[{"layout":"page","title":"Chemical Basis of Morphogenesis","lesson_number":30,"thumbnail":"/assets/images/chemicalBasis.webp","extract":"A transformative text","equation":", ","body":"This is the first page of Alan Turing's The Chemical Basis of Morphogenesis paper undergoing pattern formation. The kinetics are exactly from the Schnakenberg example: but we have taken an initial condition from an image of the first page of Turing's text. Load the interactive simulation. Press to see this evolve! You can pause the simulation and press to reset the text. Modifying different parameters (particularly ) can lead to qualitatively different solutions. Try for example. Try decreasing very slowly with the slider to see the pattern change. ","url":"/art-pdes/chemical-basis","tags":"","img":"/assets/images/chemicalBasis.webp","id":0},{"layout":"page","title":"We ❤️ PDEs","lesson_number":20,"thumbnail":"/assets/images/hearts.webp","extract":"Beating hearts and slime moulds","equation":"❤️","body":"Here are some examples of a PDE solutions on a domain based on a heart-shaped curve. Excitability Models like FitzHugh–Nagumo are the basis for a lot of work in cardiac electrophysiology and related areas. So let's solve these PDEs in a heart! Load this FitzHugh–Nagumo simulation and enjoy. You can click and select 3D to get a 3D view of the beating heart. Try this growing simulation for a crude implementation of these equations on a growing domain. Chemotaxis The next example is based on the Keller--Segel model for chemotaxis. Load this Keller--Segel simulation and enjoy! Try this growing simulation for a crude implementation of these equations on a growing domain. Warm hearted By plotting vector fields on top of the solutions to PDEs, as exemplified in the heat equation, we can visualise how heat flows from a source as it traces out a heart in this interactive simulation. ","url":"/art-pdes/chemotaxis-love","tags":"","img":"/assets/images/hearts.webp","id":1},{"layout":"page","title":"Kovalevskaya on chaos","lesson_number":5,"thumbnail":"/assets/images/Kovalevskaya.webp","extract":"Playing in time and space","equation":"","body":"Functions of space can allow us to change how a PDE solution varies in space and time. This page explores an example using an image of Sofya Kovalevskaya encoded as the function . The system uses the complex Ginzburg–Landau equation. Load one of the interactive simulations demonstrating dark soliton pinning, localised chaos, or fireflies. You can upload your own image by clicking on Images and then clicking on the image of Sofya Kovalevskaya's face next to . The image will be effectively treated as a greyscale function , which will be approximately 1 when the image is close to white and approximately 0 when the image is close to black. Change to in Definitions to see another famous mathematical face: Alan Turing. You can upload a replacement for either of these images under Images. They can each be used as heterogeneities in many parts of VisualPDE. ","url":"/art-pdes/kovalevskaya","tags":"","img":"/assets/images/Kovalevskaya.webp","id":2},{"layout":"page","title":"A-maze-ing PDEs","lesson_number":50,"thumbnail":"/assets/images/maze.webp","extract":"Searching for love in all the wrong places","equation":" ","body":"This is a simulation of a chemotaxis-like system which tries to solve a maze by gobbling up all the food as it goes. There is a source of food at the edge of the maze, and some initial (but slowly decaying) food spread throughout the maze. Will the population make it to the end? Can a web-based PDE solver help complete such puzzles? Find out in the interactive simulation! ","url":"/art-pdes/maze","tags":"","img":"/assets/images/maze.webp","id":3},{"layout":"page","title":"Spiral waves","lesson_number":40,"thumbnail":"/assets/images/spiralWaves.webp","extract":"You spin me right ’round, baby","equation":" ","body":"This is a simulation of a reaction–diffusion system loosely related to - models of spiral waves, which takes the form: Load the interactive simulation. This plots the solution as the quantity , which evolves from a wave-like initial condition into broken waves which coalesce into spiral waves as the seemingly most stable structures. Clicking can perturb these waves, and clicking with dragging can induce new spiral centres (or destroy old ones). You can also generate your own waves by setting the initial conditions to zero under Initial conditions, and then clicking to generate radial pulses, or dragging to perturb them. ","url":"/art-pdes/spiral-waves","tags":"","img":"/assets/images/spiralWaves.webp","id":4},{"layout":"page","title":"Turing on Turing","lesson_number":10,"thumbnail":"/assets/images/alan4.webp","extract":"Turing patterns in Turing's image","equation":", ","body":"Functions of space can allow us to change how a PDE solution varies in space and time. Here is an example using such a function, given by , where this function represents a picture. The equations are based on the Schnakenberg model. Load the interactive Turing simulation. You can upload your own image by clicking on Images and then clicking on the image of Alan Turing's face next to . The image will be effectively treated as a greyscale function , which will be approximately 1 when the image is close to white and approximately 0 when the image is close to black. Change to in Definitions to see another famous mathematical face. Sofya Kovalevskaya also has her own interactive Sofya simulation. Other images You can upload a replacement for either of these images under Images. They can each be used as heterogeneities in many parts of VisualPDE. Some examples include: a Halloween design a VisualPDE QR code a spiralling shell ","url":"/art-pdes/turing-face","tags":"","img":"/assets/images/alan4.webp","id":5},{"layout":"page","title":"Convection–diffusion","lesson_number":70,"thumbnail":"/assets/images/AdvectionEquation.webp","extract":"Movement along streamlines","equation":"","body":"We now look at the advection equation with diffusion (also known as the convection–diffusion equation, or sometimes the damped one-way wave equation). This takes the form where we consider two forms of the advection/drift velocity : where is a parameter The first of these expressions is a rotational velocity field about the centre of the domain, whereas the second is linear (unidirectional) advection in the direction . Load the interactive simulation with rotational advection. By default it uses Dirichlet boundary conditions. Clicking in the domain introduces some amount of mass which diffuses and advects along the rotating vector field. Importantly, Dirichlet boundary conditions will not conserve mass, and so you may see odd effects near the edges of the domain, such as the concentration being destroyed. Changing the value of will change the speed of the rotation, though much larger than the initial value may lead to bad solutions (see the numerical notes below). Making negative will change the direction of the rotation. Now click the interactive simulation with unidirectional advection. By default it uses Periodic boundary conditions. Changing will change the direction of advection, and the magnitude. This form of advection is less sensitive to details like boundary conditions, so these can be changed to explore different scenarios. In both examples, you can go to to change to a view that also plots the vector field as arrows on top of the concentration profiles. Numerical notes First-order derivatives are in general harder to deal with numerically for a variety of reasons, and in particular models involving them can depend more subtly on details such as smoothness of initial conditions. In this example, we are using a different form of the brush, which can be found under Brush This adds some smoothing to the boundaries of the bump each time the screen is clicked. This is important to reduce spurious oscillations due to the first derivative terms. ","url":"/basic-pdes/advection-equation","tags":"","img":"/assets/images/AdvectionEquation.webp","id":6},{"layout":"page","title":"Get started with the heat equation","lesson_number":10,"thumbnail":"/assets/images/heat-equation.webp","extract":"Explore how heat diffuses over time","equation":"","body":"Let's start by solving the heat equation, on a rectangular 2D domain with homogeneous Neumann (aka no-flux) boundary conditions, 1. Load the interactive simulation, which has been set up for this tutorial. 1. Click on the screen to visualise the spread of heat throughout the domain. When you click, you add localised heat to the domain. 1. Now press , paint some initial data, and then press to set it in motion. 1. Press to clear the screen. 1. You can press to change from a plot of just the density of to a plot of augmented with the vector field given by . This makes arrows that show the flux of heat as it dissipates and moves around the domain. Playing with the diffusion coefficient, What does changing the diffusion coefficient, , do? 1. Change its value by clicking and editing the value of : try increasing it by a factor of 10. 1. Now click again on the screen and see how fast this blob spreads out throughout the domain. Explore how the speed depends on the diffusion coefficient. You can safely increase up to around without hitting numerical problems: see the discussion on timestepping issues. Playing with boundary conditions What effect do the boundary conditions have? 1. Click around the corners and edges to see how the Neumann boundary conditions conserve the total amount of heat within the domain. 1. Now, go to Boundary conditions and select Periodic for . What do you notice? Is the total amount of heat still conserved? 1. What if you change the boundary conditions to Dirichlet? Explore how heat flows through the domain under these different scenarios. Exact solutions in 1D We now explore analytical solutions in one spatial dimension. We can solve the equation to get the following solution using the initial condition, with a positive integer. These solutions decay to 0 as time increases. Importantly, the rate of decay depends on the frequency of the initial perturbation , with larger (or larger ) leading to more quickly decaying solutions. You can explore these solutions in this 1D simulation. ","url":"/basic-pdes/heat-equation","tags":"","img":"/assets/images/heat-equation.webp","id":7},{"layout":"page","title":"Sources and sinks of heat","lesson_number":30,"thumbnail":"/assets/images/InhomHeatEquation.webp","extract":"Diffusion in an inhomogeneous medium","equation":"","body":"We now consider an inhomogeneous heat equation given by with homogeneous Neumann (aka no-flux) boundary conditions on a rectangular domain with side lengths , . You can use separation of variables to show that the solution at steady state looks like Load this interactive simulation. You can change the values of and to observe different patterns of sources/sinks of heat in the domain. You can use any function instead of the one given above. However, if does not satisfy the constraint that , then the solution will either grow or decrease without bound. An easy way to prove this is to multiply the equation by and integrate to find, after applying the Neumann boundary conditions, Inhomogeneous transport We can also consider a diffusion coefficient which varies in space by studying where we need for all in the domain. As a simple (though complicated-looking) example, we take, where , , and are constants. This represents radially-oscillating regions of high and low diffusion. Setting an initial condition of and Dirichlet boundary conditions, we can observe an immediate partitioning of the initial heat into regions bounded by the maxima of the cosine function. Click in this inhomogeneous simulation to see this, and play around with the values of , and . ","url":"/basic-pdes/inhomogeneous-heat-equation","tags":"","img":"/assets/images/InhomHeatEquation.webp","id":8},{"layout":"page","title":"Inhomogeneous waves","lesson_number":40,"thumbnail":"/assets/images/InhomWaveEquation.webp","extract":"Waves in an inhomogeneous medium","equation":"","body":"We now consider an inhomogeneous wave equation, with homogeneous Neumann (aka no-flux) boundary conditions. This equation can be solved numerically as long as for all in the domain. Load the interactive simulation, which uses the example Importantly, we need to ensure the solution makes sense. You can change the values of and to observe different patterns of regions where waves propagate at different speeds. In particular, using the the function above will lead to corners inside of the domain with very slow wave speeds, and these will become visually apparent quickly. Unlike in the homogeneous case, we by default plot here, but you can change this to by clicking . Damped waves and inhomogeneous boundaries We next consider the damped wave equation, with inhomogeneous Dirichlet boundary conditions, on a square domain. Load this damped simulation, where initially . Try increasing the damping to, for example, to observe how this changes the wave propagation into the domain from the boundaries. What happens when you play with the frequency, ? ","url":"/basic-pdes/inhomogeneous-wave-equation","tags":"","img":"/assets/images/InhomWaveEquation.webp","id":9},{"layout":"page","title":"Bending beams and deforming plates","lesson_number":60,"thumbnail":"/assets/images/plateEquation.webp","extract":"The plate equation","equation":"","body":"Let's consider a (damped) beam equation: initially with fixed boundary conditions given by along the boundary. The constant represents the relative size of the domain and its material properties (e.g. stiffness), is a damping constant, and a gravity-like force. Load the interactive beam equation simulation. Click to push down on the beam, creating a localised depression which creates ripples in the beam nearby. Now go to Boundary conditions and select Neumann for , , and . This will use the following 'free end' boundary conditions: Deformable plates Let's next look at the (damped) plate equation, with fixed boundary conditions given by along the boundary. Load the plate equation simulation. Initially the plate is deformed to a value of everywhere, representing an initial deformation which instantaneously snaps to the fixed condition of at the edges, which gives rise to compression waves which propagate inwards. Click to compress the plate downward locally, and observe waves propagating from this disturbance. Numerical notes As in previous examples, we must write the second time derivative using a system of first-order equations. We also have to use an algebraic equation to represent the biharmonic term: which is the plate equation for . The parameter is used to prevent spurious oscillations as seen in the wave equation. 3D deformations Load the 3D simulation. Click! This is the same simulation as in the 2D plate equation above, but shown in 3D with a view that can be rotated. ","url":"/basic-pdes/plate-equation","tags":"","img":"/assets/images/plateEquation.webp","id":10},{"layout":"page","title":"Schrödinger equation","lesson_number":50,"thumbnail":"/assets/images/SchrodingerEquation.webp","extract":"Interactive quantum mechanics","equation":"","body":"We now consider the Schrödinger equation, with homogeneous Dirichlet boundary conditions. We will first consider a variant of this equation with artificial diffusion, as in the wave equation shown before, which takes the form where are positive constants. We use the initial condition as this corresponds to a given energy state of the system. Load the interactive simulation. You can change the initial eigenfunction frequency by modifying and , and then pressing 'R' to restart the simulation. By default, the solution plotted is the density , which will be (approximately) stationary for long periods of time. You can plot only the real or imaginary part under the Views pane by clicking , and see how these solutions now oscillate in both space and time. Increasing the values of and will increase the speed at which this oscillation occurs, as such an initial condition will correspond to higher energy states. Heterogeneous potentials We can also choose a potential which has the effect of localising some features of the solution. As an example, we consider which can be played with in this heterogeneous simulation. As the solution evolves, one can observe tunnelling from local potential wells where the solution is highly concentrated, out to potential wells further away from the localised initial condition. Note that here the colour scale is constantly changing to observe the maximal and minimal values of , as these vary substantially during an oscillation. Numerical notes The solver only works for real systems of equations. So in fact what is being simulated is the system which is a (nondimensionalised) Schrödinger equation for . The parameter is used to prevent spurious oscillations. Of course, even with this artificial parameter , our numerical method does not preserve probability, given by as can be seen in the 1D example below. Particle in a 1D potential well We can consider an analogue of a particle in a potential well by putting a Gaussian wave packet inside a quadratic potential. For short times, such a wave packet acts like a particle bouncing between the two walls of the potential with some fixed energy, as you can see in this 1D simulation. The total probability, shown in the bottom corner, is approximately conserved here as we have set and taken a sufficiently small simulation step, consistent with more sophisticated simulation techniques. See the discussion at the bottom of Validating VisualPDE for more details about the sensitivity to timestepping accuracy. ","url":"/basic-pdes/stabilised-schrodinger","tags":"","img":"/assets/images/SchrodingerEquation.webp","id":11},{"layout":"page","title":"Explore the wave equation","lesson_number":20,"thumbnail":"/assets/images/waveEquation.webp","extract":"Play with waves and vibrations","equation":"","body":"Let's next look at the wave equation, on a rectangular 2D domain with homogeneous Neumann (aka no-flux) boundary conditions, 1. Load the interactive simulation, which has been set up for this tutorial. 1. Click on the screen to visualise a disturbance in the medium which will then propagate in all directions. 1. Now press , paint some initial data, and then press to set it in motion. 1. Press to clear the screen. Playing with the diffusion coefficient, What does changing the diffusion coefficient, , do? 1. Change its value by clicking Parameters and editing the value of : try increasing it by a factor of 10 or even 100. 1. Now click again on the screen and see how fast the disturbance spreads out throughout the domain. Explore how the speed depends on the diffusion coefficient. Numerical notes The VisualPDE solver only works for systems of first-order (in time) equations. So in fact what is being simulated is the system which becomes the wave equation when . Note that the term in the second equation is a kind of cross-diffusion, with diffusing into . The parameter is used to prevent spurious oscillations due to the equation being hyperbolic. Try varying the value of to observe how it changes the solution structure. Standing wave solutions If we take initial conditions of with Neumann boundary conditions, we can find a standing wave solution of the form which oscillates in time and space. You can play with such an initial condition in this initialised simulation, changing and in Parameters and restarting the simulation by pressing to see how these parameters influence the solution. The damping factor is also set to zero in this case. If you increase its value, the solution amplitude will decay over time. If you change the boundary conditions to Dirichlet (and set ), the simulation will exhibit some fascinatingly symmetric oscillations. 1D and 2D waves In a 1D domain, d'Alembert's solution to the wave equation can be used to show that an initial disturbance in (and not ) will cause rightward and leftward moving waves. See this in a 1D simulation. In principle the same concept works for higher dimensions, though reflections from boundary conditions can lead to more complicated behaviour, as seen in this 2D simulation plotted as a surface. ","url":"/basic-pdes/wave-equation","tags":"","img":"/assets/images/waveEquation.webp","id":12},{"layout":"page","title":"Turing instabilities are not enough","lesson_number":140,"thumbnail":"/assets/images/TuringNotEnough.webp","extract":"Beyond the limits of linear theory","body":"Linear stability theory is often used to predict regions of pattern-forming (or 'Turing') instabilities. However, in the presence of multiple homogeneous equilibria, these instabilities do not guarantee that a system develops a pattern. Here, we implement interactive versions of three local models in the paper \"Turing instabilities are not enough to ensure pattern formation.\" In each case, the default is a 2D spatial domain with periodic boundary conditions. The boundary conditions can be modified by clicking Boundary conditions, and the domain can be changed to a 1D interval by clicking Domain and setting the dimension to be 1. By default, an initial small random perturbation of a homogeneous equilibrium is used to generate a Turing instability which eventually leads to the solution approaching a different homogeneous equilibrium. You can alternatively click to introduce a localised perturbation, or directly input a different initial condition. Importantly all parameters and functional forms can also be changed. Below we highlight specific parameters that give different dynamics. Reaction--diffusion system This reaction--diffusion simulation explores the system Keller--Segel chemotaxis This Keller--Segel simulation corresponds to the equations Localised solutions can be found by setting and . Reducing further to for this value of leads to spatiotemporal behaviour similar to using the purely logistic demographic term as in this alternative model. Biharmonic equation This biharmonic simulation corresponds to the equation Setting will instead lead to localised states that are near the boundary of stability. These will decay slowly for but appear to remain stable for .","url":"/mathematical-biology/Turing-conditions-are-not-enough","tags":"","equation":"undefined","img":"/assets/images/TuringNotEnough.webp","id":13},{"layout":"page","title":"Bacteria concentration in flow","lesson_number":160,"thumbnail":"/assets/images/bacteriaInFlow.webp","extract":"A toy model of decay and advection in rivers","body":"Modelling the concentration of bacteria in a river is a complex, multifacted problem. This example lets us explore a toy model that manages to capture some of the key ideas by ignoring much of the real-world complexity. We limit ourselves to a single reach (i.e. a stretch of river without anything remarkable along it), and specify an inlet concentration of bacteria at the upstream (left) edge of the domain. Clicking in the simulation below will instantly add bacteria to any point in the river, which will then be carried downstream (right) by the flow. Bacteria decay over time at a constant rate, mimicking UV exposure (though this varies with the time and season in real life). We can adjust the inlet concentration, the decay rate of the bacteria, or the flow rate with the sliders below. Phrased mathematically, we are solving an advection–reaction equation for the concentration of bacteria, given by where is the flow speed, is the decay rate, and is the distance along the river. To play with the details of this model, try out the full-screen simulation. In that simulation, sliders can be found by clicking Parameters ","url":"/mathematical-biology/bacteria-in-flow","tags":"","equation":"undefined","img":"/assets/images/bacteriaInFlow.webp","id":14},{"layout":"page","title":"Bistability: invasion and persistence","lesson_number":30,"thumbnail":"/assets/images/bistableTravellingWaves.webp","extract":"Spatial Allee effects and changing wavespeeds","equation":"","body":"Next we'll consider a bistable reaction--diffusion equation, sometimes referred to as the Allen--Cahn or Chaffee--Infante equation, where is a parameter. As with the Fisher–KPP equation, this system will admit travelling waves. Here however, one can show that the wavespeed is proportional to and, hence, we expect the waves to change their direction of travel when crosses the value 0.5. Load the travelling wave simulation. Click within the box to visualise a 'line' of a population, which will then spread out as a planar wave. The value is the threshold between expanding and contracting waves (positive or negative values). Take values of , , and to see how this influences the propogation of this wave. You can change the brush to form circular regions (or input directly initial conditions) to see how other geometries of spreading waves are affected by parameter variations in this bistable system. Spatial Allee effects In the above simulations, we considered near the boundary, and initial waves that had sufficient size. Biologically we are often interested in the question of small invading populations, which becomes complex when both extinction () and persistence () are possible. We'll set so that in principle a wave of population can invade the domain, but consider only small initial regions where . Load the interactive Allee simulation. Click within the domain to set the value of to 1 in some small region. You should notice that the initial population dies out quickly despite being locally stable. Diffusion is spreading the population too quickly. The parameter determines the size of the initial population. Increasing it slightly (e.g. setting ), allows the initial population to grow and overcome this diffusion-induced decay. Alternatively, for smaller values of , try pausing the simulation , painting a larger initial region of , and then pressing to set it in motion. You will notice that, for sufficiently large initial regions, the steady state can invade the steady state . The precise quantities and geometry of these initial conditions can influence persistence. It is difficult to analytically determine conditions for when an invasion is successful or not, as it can depend on both the size and shape of the initial perturbation, as well as the parameters and . You can explore different values of these parameters and how they influence the success or failure of a population to persist in a new environment. Advection and spatial Allee effects We can add an advection term to the equation to model movement due to, for example, putting our population in a flowing body of water. The equation now looks like: where is a velocity and is a direction of advection. We implement this in this advective bistable simulation, starting near the critical Allee threshold with . It can be an interesting task to paint an initial condition capable of surviving so close to this boundary to extinction. ","url":"/mathematical-biology/bistable-travelling-waves","tags":"","img":"/assets/images/bistableTravellingWaves.webp","id":15},{"layout":"page","title":"Brusselator pattern formation","lesson_number":60,"thumbnail":"/assets/images/Brusselator.webp","extract":"Turing instability regions","equation":", ","body":"Another Turing system is the Brusselator, given by where we take . Load the interactive simulation. You can change the diffusion coefficients to effectively change the size of the domain (the diffusion coefficients will scale like where is the domain size, so decreasing both of these numbers by a factor of 100 will effectively simulate a domain 10 times larger). As the patterns have approximately fixed wavelengths, this should lead to a different number of pattern elements. The homogeneous equilibrium is stable for . You can check this condition for the parameters , , for which the instability threshold is . So we expect patterns for , and we expect the system to return to the homogeneous steady state for . Hyperbolic Brusselator & Turing–Wave instabilities One can show that two–species reaction–diffusion systems can only ever have Turing–like instabilities with real growth rates. In contrast, hyperbolic reaction–diffusion systems (or systems with more than two species) allow for Turing–Wave (or sometimes Wave or Turing–Hopf) instabilities. Such instabilities lead to spatial eigenfunctions that grow and oscillate, typically giving rise to spatiotemporal dynamics. Here we consider a hyperbolic version of the Brusselator given by where there are two new terms proportional to and we have instead put the diffusion ratio on the equation. The normal Turing instabilities will occur for , but new Turing–Wave instabilities may occur for , so we set . In a one-dimensional simulation, an initial cosine perturbation on a small domain leads to an oscillating cosine, which is what linear theory would predict. The system loses this instability as is decreased to or below, with a decaying oscillation amplitude for intermediate values. On a larger domain, a two-dimensional simulation exhibits a variety of transient dynamics depending on exactly how the uniform equilibrium is perturbed, culminating in `wave–like' spatiotemporal behaviour. Again decreasing or increasing will reduce the effect of the instability, decreasing the amplitude of the solution. For more details on such systems and their generalisations, take a look at this paper. ","url":"/mathematical-biology/brusselator","tags":"","img":"/assets/images/Brusselator.webp","id":16},{"layout":"page","title":"Reaction–cross-diffusion systems","lesson_number":100,"thumbnail":"/assets/images/dark-soliton.webp","extract":"Dark solitons and extended Turing spaces","equation":" ","body":"We now consider an example of a cross-diffusion system based on the following reaction kinetics: which is a cross-diffusion version of the Schnakenberg model. Load the interactive simulation The default parameters create localised inverted spots (sometimes called 'dark solitons') wherever the perturbation is, but these do not seem to propagate patterns in any direction. Setting the value of gives pattern formation closer to the Schnakenberg system observed before, though note that the self-diffusion terms are equal. Finally taking allows for spatiotemporal behaviors, as the homogeneous equilibrium is then well into a Hopf regime. ","url":"/mathematical-biology/cross-diffusion","tags":"","img":"/assets/images/dark-soliton.webp","id":17},{"layout":"page","title":"Cyclic competition models","lesson_number":110,"thumbnail":"/assets/images/rock-paper-scissors.webp","extract":"Rock, paper, scissors – spiral waves!","equation":" ","body":"We now consider an example of a reaction-diffusion system based on the following reaction kinetics: These are an example of a generalised Lotka–Volterra system. If we set , then each population outcompetes another, and hence their relative fitness forms a cycle. This kind of model is also known as a spatial rock-paper-scissors game. To make things more interesting, we will allow the species to diffuse at different rates. Load the interactive simulation This begins with an initially structured population that eventually devolves into a complex spatiotemporal motion, with spiral waves a dominant feature. This system exhibits a wide range of behaviours. One of the most interesting is that if you allow spiral waves to form, and then set all diffusion coefficients to be equal (e.g. by changing to ), the system will still admit spiral waves despite not having a Turing-like instability. ","url":"/mathematical-biology/cyclic-competition","tags":"","img":"/assets/images/rock-paper-scissors.webp","id":18},{"layout":"page","title":"FitzHugh–Nagumo and excitability","lesson_number":80,"thumbnail":"/assets/images/FitzHugh-Nagumo.webp","extract":"Patterns, spiral waves, and chaos","equation":", ","body":"Here we look at the FitzHugh–Nagumo model, given by where we take . Load the FitzHugh–Nagumo simulation Click in the domain to initiate a pattern-forming instability, which will form roughly concentric rings as it expands. This system has many different kinds of solutions which are stable over long time periods. To see this, change the initial condition, under Initial conditions so that has the value 'RAND'. Then press to restart the simulation. It should now exhibit patterns which are much more spot-like. Turing–Hopf bifurcations We now vary the parameters from the previous simulation so that it supports both pattern formation, but also oscillations. These oscillations come from steady states undergoing Hopf bifurcations. In such regimes, one can often find a range of complex spatial, temporal, and spatiotemporal behaviours, many of which can be simultaneously stable for different initial conditions. To illustrate this, we consider the initial conditions for some integer and domain length . Load the Turing-Hopf simulation This simulation can display long-time solutions that exhibit all three kinds of behaviour, depending on the values of , , and the other parameters. Try , and for example. Three-species variant A three-species variant of the FitzHugh–Nagumo model is Load the three-species simulation The simulation demonstrates the dynamics of this system in a regime which has both homogeneous limit cycles and pattern formation competing against one another. The initial pattern formed in this simulation will eventually be destroyed by the oscillations. You can increase the value of to stabilise the pattern for longer, and if , the pattern will eventually overtake the oscillations and fill the entire domain. ","url":"/mathematical-biology/fitzhugh-nagumo","tags":"","img":"/assets/images/FitzHugh-Nagumo.webp","id":19},{"layout":"page","title":"Gierer–Meinhardt pattern formation","lesson_number":70,"thumbnail":"/assets/images/GiererMeinhardt.webp","extract":"Spots and stripes","equation":", ","body":"Another Turing system is the Gierer–Meinhardt model, given by where we take and . Load the interactive simulation Changing any of the parameters can lead to different solutions, though this system generically favours spot-like patterns. Note that the colour scale here is fixed, but that changing parameters will lead to solutions with different maxima and minima, so using the auto-snap feature under Colour Auto snap may be advised. Stripes stability We can observe the instability of stripe patterns in this model by choosing initial conditions which become stripes along one direction. We set with an integer. Load the simulation Change the value of and restart the simulation by pressing . In each case a different number of initial stripes will evolve into some number of stripes, but they should persist indefinitely. Now click on or near a stripe to destabilise it into spots. Note that the brush value, found in Brush is set to , so that it is a relatively small perturbation of the current solution. Saturation leads to stripes A common way to obtain stripe-like patterns in this model is to consider saturation of the self-activation term ( in the equation above). In this case we have the model where is a saturation constant. For very large values of , the system will not admit Turing patterns, and for very small values it will behave as in the above spot-forming model. However, for intermediate values of one can get labyrinthine patterns. Observe the patterns in this stripey simulation Try increasing or decreasing the size of to observe how this influences spot/stripe selection in the system. Note that the colour scale is changing to match solution maxima and minima. ","url":"/mathematical-biology/gierer-meinhardt","tags":"","img":"/assets/images/GiererMeinhardt.webp","id":20},{"layout":"page","title":"Survival in a harsh environment","lesson_number":20,"thumbnail":"/assets/images/harsh-environment.webp","extract":"Exploring the effects of boundary conditions","equation":"with no-flux boundary conditions","body":"We'll continue studying the logistic reaction-diffusion model, but now we consider different boundary conditions. Load the interactive simulation. The initial conditions leads to population growth in select areas of the domain, which eventually reach a large density and begin spreading. As the system initially has no-flux boundary conditions, the population will reach carrying capacity everywhere. Now change the boundary conditions to \"Dirichlet\", taking the constant value to be . This will affect the solution near the domain edges, but not the interior, as the diffusion is small. Now increase the diffusion coefficient by deleting zeroes from the value of . This will increase the region over which the boundary conditions affect the structure of the solution. One can show that the positive equilibrium exists and is globally stable if and only if as in our simulation. For diffusion coefficients larger than this value, the extinction equilibrium, , is stable. Try simulating the system at , and , clicking if needed to introduce some additional population into the domain. Note: You can check the condition more precisely by looking at values closer to the boundary, but the timescale to reach equilibrium will be long, and the amplitude of will become very small. The analytical condition above does not depend on the carrying capacity . Set , and simulate the system at and in this case to confirm that will not change the boundary of where the populations persists, though it will change the structure of the solution when . Again you may need to click to introduce some population into the domain. With this value of , it is easier to see the solution's behaviour near the critical diffusion threshold. The values and are good choices, for example. ","url":"/mathematical-biology/harsh-environment","tags":"","img":"/assets/images/harsh-environment.webp","id":21},{"layout":"page","title":"Dynamic bifurcations with heterogeneity","lesson_number":120,"thumbnail":"/assets/images/heterogeneousGiererMeinhardt.webp","extract":"Isolated patterns and moving spikes","equation":" ","body":"This is a brief example of messy boundary conditions and spatial heterogeneity inducing complex dynamical behaviours. We consider a heterogeneous version of the Gierer–Meinhardt model: where we will vary the domain and boundary conditions, as well as the functions , in the examples below. Load the Gierer–Meinhardt simulation The simulation starts by taking homogeneous Dirichlet boundary conditions for , and homogeneous Neumann boundary conditions for . Despite an initially uniform solution, these boundary conditions are sufficient to perturb the equilibrium to form a patterned state. This simulation sets and , so that taking nonzero values of and will lead to spatially heterogeneous forcing. Try setting or to observe how this leads to size and wavelength differences across the domain. With nonzero values of or , restarting the simulation by pressing can lead to transient local oscillations and somewhat different selection of where spots will appear. 1D bifurcations These systems are simpler to understand in 1D spatial domains, where we can isolate some aspects of their behaviour analytically. In particular, it is known that spike solutions in 1D can move along gradients in spatial heterogeneity, and that this can induce instabilities leading to periodic spike patterns which we now explore. First consider this 1D simulation using the same mixed boundary conditions above, with and . Spikes form across the domain at different amplitudes. The rightmost one undergoes a Hopf instability leading to oscillations in its amplitude, which eventually die out as it moves to the left. Eventually the leftmost spike becomes unstable, making room for the others to move further left. This eventually leads to enough room at the right for a new spike to emerge, which again undergoes a brief oscillatory period before settling down. This behaviour repeats indefinitely. The oscillations at the right, and the boundary spike on the left which does not move, are not terribly relevant for the movement or creation/anhillation of spikes. These are just artifacts of our particular choice of heterogeneity and kinetics. We can get rid of these artifacts in the following way. We use Dirichlet conditions to introduce a flux of the inhibitor at the boundaries to dampen these spike oscillations and remove the leftmost boundary spike. We set at the boundaries (retaining the condition from the previous simulation) in this modified simulation. This more clearly localises the spike movement dynamics. If you change the value of at the boundaries from 2 to 1, you can observe the boundary spikes from the previous simulation returning (though reducing it much below 1 can lead to numerical issues due to the dependence of the equation for on ). ","url":"/mathematical-biology/heterogeneous-dynamics","tags":"","img":"/assets/images/heterogeneousGiererMeinhardt.webp","id":22},{"layout":"page","title":"Keller–Segel chemotaxis","lesson_number":90,"thumbnail":"/assets/images/KellerSegel.webp","extract":"Slime moulds and cell movement","equation":", ","body":"We now consider Keller–Segel models of chemotaxis of the form where we take Load the interactive simulation The initial condition condition is a small random initial population, which eventually grows towards the homogeneous equilibrium of , , but will undergo pattern formation as it nears this equilibrium. Try changing the values of , , and and then pressing to restart the simulation. Importantly, this system will have some hysteresis in that patterns may appear differently depending on where they evolved from, and when you change the parameters (for example, if you restart the simulation or just change the parameters and let it evolve from one state to another). The colour bars are fixed so that taking leads to patterns which saturate the colour scale. Linear instability analysis predicts a pattern-forming instability for parameters satisfying Test this inequality by varying parameters (for example, around to ), leaving the other parameters as they are. ","url":"/mathematical-biology/keller-segel","tags":"","img":"/assets/images/KellerSegel.webp","id":23},{"layout":"page","title":"Schnakenberg pattern formation","lesson_number":50,"thumbnail":"/assets/images/Schnakenberg.webp","extract":"Spots and stripes","equation":", ","body":"Next we'll consider a classical reaction–diffusion system which forms Turing patterns, where we need to form patterns, and typically take . Load the Schnakenberg simulation Click within the box to visualise a pulse of a population, which will then spread out as a planar wave leaving patterns behind it. You can change the diffusion coefficients to effectively change the size of the domain (the diffusion coefficients will scale like where is the domain size, so decreasing both diffusion coefficients by will effectively simulate a domain times larger). As the patterns have approximately fixed wavelengths, this should lead to a different number of pattern elements. With , the system forms spot-like patterns. If you reduce to , instead stripe-like patterns will be formed. The homogeneous equilibrium can undergo Hopf bifurcations for small values of . In this regime, one can find Turing patterns, homogeneous oscillations, and complex spatiotemporal interactions of Turing and Hopf instabilities. One example is this interactive simulation, but you can find others by tweaking the parameters. Check out this growing simulation for a crude implementation of the Schnakenberg system on a growing domain with Dirichlet boundary conditions. ","url":"/mathematical-biology/schnakenberg","tags":"","img":"/assets/images/Schnakenberg.webp","id":24},{"layout":"page","title":"Hills and valleys","lesson_number":150,"thumbnail":"/assets/images/SpringOnTopography.webp","extract":"Effects of topography on models of water and vegetation","body":"Many of the spatial models that people study assume flat, homogeneous domains. In this example, we'll numerically explore what happens if we replace flatness with all of real life's roughness. Hillside vegetation In our page on vegetation patterns, we explore the Klausmeier model, which can be stated as when written in terms of water and plant biomass . There are many extensions of this model to include varying, real-world topography, some of which are neatly summarised in a 2018 paper. We'll use the simplest possible model, which modifies the original to become where is the spatially varying height of the landscape. The parameters and capture the relative sizes of the water transport terms. Load this Klausmeier simulation, which implements the modified PDE for a given . Watch the vegetation invade into water-rich regions in the valleys, and seemingly travel uphill following rainfall, which then get used up and dry out. Try varying the parameters and to see how they impact the structure of patterns. What effect does reducing have on the patterns formed? Do they resemble those in our flat-domain example? Rainfall on the hilltops Let's take a more detailed look at water. We could adapt the shallow water equations that we used in our Visual Story on waves, but instead we'll use a simpler model that's really more suited to glaciers and lava than water. For water of height above topography of height , this model of gravity-driven flow over terrain reduces to the scalar PDE where represents the relative strength of gravity to the stickiness of the fluid. This equation (with some helpful numerical tricks) is encoded in an rainfall simulation that lets us click to introduce water to the rolling landscape. Try clicking to introduce spots of water and watch as they flow down into the valleys. Make it rain by dragging over the terrain, gradually filling up the riverbed. Try modifying the equation for by including a constant rainfall (0.001 should be enough) and see the landscape slowly fill. We've picked an example of real-world topography for you to explore, but you can swap this out for your local area by swapping out the topographical map found by clicking Images. Springing to life Of course, rivers aren't only filled by rain. Let's see what happens if we introduce a spring to the hillside. This spring simulation captures the same river system as before, but now with a spring emerging from one of the hilltops. Watch as the spring spreads down the hillside and gradually fills up the large riverbed. Try speeding up the process by clicking to add in additional springs. Looking for high-resolution versions of these simulations? Try out: high-resolution rain high-resolution spring These simulations might stretch your device to its limits! ","url":"/mathematical-biology/topography","tags":"","equation":"undefined","img":"/assets/images/SpringOnTopography.webp","id":25},{"layout":"page","title":"Logistic travelling waves","lesson_number":10,"thumbnail":"/assets/images/travelling-waves.webp","extract":"A classic example","equation":"with periodic boundary conditions","body":"Here we'll consider a classical reaction–diffusion equation, with a logistic nonlinearity. This is often referred to as the Fisher–KPP equation, with periodic boundary conditions. 1. Load the interactive simulation. 1. Click within the box to visualise a 'line' of a population, which will then spread out as a planar wave. 1. Explore different parameters in this model, namely , , and . 1. Does the wave speed, , approximately follow the scaling law derived via linearisation of the wavefront (that is, )? One interesting experiment to try is to see what happens if you simultaneously decrease and increase (or vice versa). This should have (approximately) the same effective wave speed, but the profile will be different as you have effectively changed the time and space scales in opposite directions. 1. Does the value of the carrying capacity, , matter for the speed of the wave? Or the profile? 1. Next change the brush type to a circle and explore how circular waves travel. These are similar to the planar (effectively 1D) waves above, but their speed will be slightly different as the curvature of these wave fronts will influence their speed. 1. You can also explore this kind of wave in a 1D model. You can press to reset the simulation as you change parameters. Competitive exclusion Travelling waves also occur in multispecies models. A model of two competing populations (red and grey squirrels) can be written as, where is a diffusion coefficient, are interspecific, and are intraspecific competition coefficients. Competitive exclusion can lead to one of the species being driven to extinction by the other. This squirrel simulation explores the grey squirrels driving the red to extinction across a map of the United Kingdom. Epidemic waves As another example of logistic travelling waves, we can consider the SIS model of infection given by where is the number of susceptible individuals, the number of infected individuals, a recovery rate, and an infection rate. Since this system is mass conserving (that is, must be a constant), we can rewrite this model purely in terms of the proportion of infected individuals to get where we have rescaled the infection and recovery rates and added a diffusion term to model spatial movement of infected individuals. As long as , this model will have the same travelling-wave behaviour as the Fisher–KPP equation above, where is an unstable steady state, and is a stable endemic equilibrium. Visualise an epidemiological travelling wave across the USA to see how this plays out in time and space. ","url":"/mathematical-biology/travelling-wave","tags":"","img":"/assets/images/travelling-waves.webp","id":26},{"layout":"page","title":"Banded vegetation patterns","lesson_number":130,"thumbnail":"/assets/images/VegetationPatterns.webp","extract":"Stripes moving towards water","equation":", ","body":"Here we look at a model of vegetation patterning known as the Klausmeier model, written in terms of water and plant biomass . Load the interactive simulation. Note that this model always has a plant-extinction state being stable. The simulation starts in a parameter regime where pure stripes (regular patterns) of plants are favoured over time. If you instead set , , the environment will be much harsher, leading to less regular patterns. However, this also makes the extinction state more stable, so you may have to brush sufficient initial data to overcome this Allee-like effect. Localised solutions Similarly to the localised patterns in Swift–Hohenberg, Dan Hill has provided examples of dihedrally symmetric localised patterns in this model. You can find initial conditions that simulate such patterns in this localised simulation, and more information about the rigorous theory underlying them in his 2023 paper. ","url":"/mathematical-biology/vegetation-patterns","tags":"","img":"/assets/images/VegetationPatterns.webp","id":27},{"layout":"page","title":"Pattern formation & advection","lesson_number":70,"thumbnail":"/assets/images/GrayScottAdvection.webp","extract":"Going with the flow?","equation":"","body":"Each of the examples on this page will be a variation of a previous example incorporating one or more linear advection terms. This will introduce a velocity parameter and, in the unidrectional case, a direction . Gliders swimming upstream We start with the glider example from the Gray–Scott model, and add an advection term in the equation to get an example of drifting gliders. The boundaries here will destroy the patterns as mass will be lost at boundaries orthogonal to the flow. Decreasing will allow the moving spots to survive longer, whereas increasing it will lead to wave-selection. As discussed in its own page, this model has a huge range of behaviours, and these are all likely influenced by advection. Localised Swift–Hohenberg swiftly moving We next consider the localised solutions from the Swift–Hohenberg equation, and consider two cases of moving patterns under advection. The first is unidirectional motion at an angle , and the second is rotational advection. In both cases, changing impacts the velocity of this movement. Note that if becomes too large in the rotational case, the pattern can generate structures which misbehave at the boundaries (as these will interact with advection in odd ways). In particular, the rotating velocity field which is advecting is itself not periodic. Changing and restarting the simulation allows you to explore how these different localised solutions change their structure under advection. ","url":"/nonlinear-physics/advecting-patterns","tags":"","img":"/assets/images/GrayScottAdvection.webp","id":28},{"layout":"page","title":"Viscous Burgers' equation","lesson_number":60,"thumbnail":"/assets/images/BurgersEquation.webp","extract":"Nonlinear waves","equation":"","body":"(Viscous) Burgers' equation: Load the interactive simulation. Locally in space, the wave is translating to the right with a speed , and hence larger initial amplitudes have greater speed. In the limit of , the solution forms discontinuous shock solutions. These can be approximated with small (as these solutions will be smooth), though advection will cause numerical difficulties (e.g. oscillations near the front of the wave). Nonzero leads to some loss of amplitude/height of the wave, but otherwise roughly captures the limiting shock behaviour as long as it is sufficiently small. ","url":"/nonlinear-physics/burgers","tags":"","img":"/assets/images/BurgersEquation.webp","id":29},{"layout":"page","title":"Cahn–Hilliard equation","lesson_number":30,"thumbnail":"/assets/images/CahnHilliard.webp","extract":"Phase separation","equation":"","body":"We now study the Cahn–Hilliard equation with an extra reaction term, with periodic boundary conditions. Load the interactive simulation The initial condition is taken to be random noise at the level of the discretised system, and the initial timescale, given by , is small. Increase by one or two orders of magnitude to speed up the simulation, and observe the coarsening process as described in this 2001 article. ","url":"/nonlinear-physics/cahn-hilliard","tags":"","img":"/assets/images/CahnHilliard.webp","id":30},{"layout":"page","title":"The Gray–Scott model","lesson_number":50,"thumbnail":"/assets/images/GrayScott.webp","extract":"Intricate reaction–diffusion patterning","equation":", ","body":"A reaction–diffusion system heavily studied for its complex dynamics is the Gray–Scott system, given by where we take and only vary . This model has a wide range of behaviours, shown in another WebGL simulator that partially inspired VisualPDE. Load the interactive simulation to explore the system. A famous 1993 paper on this model explored a range of the parameters and to classify different behaviours, and many people have hence made these parameters depend linearly on and to see all of this behaviour at once. This classification simulation explores this approach, with depending on in the range and depending on in the range . Building from the previous simulation, we can rescale the heterogeneity to still be monotonic, but to use up more of the domain to see different dynamical regimes. Explore this in this rescaled simulation, where we also plot the variable instead by default (you can click on to change this to plot instead). Interestingly, the value of used gives a very rich parameter space, whereas making smaller reduces the regions of patterned behaviour, and taking larger increases it at the cost of making things more stationary and more spot-like for most of the parameter domain. Furthermore, when the system no longer supports stationary patterns, but does exhibit waves similar to the spiral waves in the equal-diffusion case of the cyclic competition models. Below we've listed some parameter combinations that give rise to different and interesting behaviours. One of our favourites is the moving spots simulation, which exhibits spots bobbing around. Initiate this motion and then increase slowly to about . The spots become sparse and start exhibiting strange diversions in their motions. | | | Description | |---|---|---| | 0.037 | 0.06 | Labyrinthine | | 0.03 | 0.062 | Spots | | 0.025 | 0.06 | Pulsating spots | | 0.078 | 0.061 | Worms | | 0.039 | 0.058 | Holes | | 0.026 | 0.051 | Spatiotemporal chaos | | 0.034 | 0.056 | Intermittent chaos/holes | | 0.014 | 0.054 | Moving spots (glider-like) | | 0.018 | 0.051 | Small waves | | 0.014 | 0.045 | Big waves | | 0.062 | 0.061 | U-skate world | ","url":"/nonlinear-physics/gray-scott","tags":"","img":"/assets/images/GrayScott.webp","id":31},{"layout":"page","title":"Solitons in the Korteweg–De Vries & Zakharov–Kuznetsov equations","lesson_number":80,"thumbnail":"/assets/images/KdV.webp","extract":"Solitary movement through each other","equation":"","body":"Here is an implementation of the Korteweg–De Vries (KdV) equation, which is a very simple model of solitons, as described at the bottom of the page for the nonlinear Schrödinger equation. The interactive simulation starts with two solitons of different amplitudes and speeds, with the larger one moving more quickly and hence overtaking the smaller one at first. While they occupy the same space, these solitons cannot be clearly distinguished as their ampltiudes locally add together, but as the faster soliton moves more quickly it eventually separates from the slower soliton, and neither speed nor amplitude of either soliton is changed. This example was helpfully constructed by Paul Sutcliffe. 2D vortical solitons There are also 2D analogues of solitons sometimes called vortical solitons. The modified Zakharov–Kuznetsov model is given by where is a small dissipative term used to reduce radiation. This 2D soliton simulation shows one such vortical soliton moving in the positive direction. ","url":"/nonlinear-physics/kdv","tags":"","img":"/assets/images/KdV.webp","id":32},{"layout":"page","title":"Kuramoto–Sivashinsky equation","lesson_number":40,"thumbnail":"/assets/images/KuramotoSivashinsky.webp","extract":"Chaos at your fingertips","equation":"","body":"We now study the Kuramoto–Sivashinsky equation, with periodic boundary conditions. Load the interactive simulation. If you perturb the solution, it should devolve into a kind of spatiotemporal chaos of oscillation and movement. Importantly, the patterns which emerge have a certain set of coherent wavelengths, which suggests that the dynamics is that of finite-dimensional chaos, rather than fully turbulent mixing. Numerical notes The equation above is far from the cross-diffusion kind of system our solver is built for. However, using the product rule and an algebraic substitution, we can write it as: where is a damping coefficient used to help stabilise the solver. For , this is exactly the fourth-order equation above. ","url":"/nonlinear-physics/kuramoto-sivashinsky","tags":"","img":"/assets/images/KuramotoSivashinsky.webp","id":33},{"layout":"page","title":"Complex Ginzburg–Landau","lesson_number":20,"thumbnail":"/assets/images/complexGinzburgLandau.webp","extract":"A world of complexity","equation":"","body":"Here is an implementation of a (complex) Ginzburg–Landau equation given by where we typically need for solutions to exist. Load the interactive simulation Change the parameter to see a wide range of interesting behaviours. The values all give distinct dynamical regimes, for example. Numerical notes As in the Schrödinger equation, we have to separate out the real and imaginary parts of to simulate it. We write to find Solitons The nonlinear Schrödinger equation is a special case of this model, typically written as The sign of determines if the system is 'focusing' or 'defocusing' and, hence, if we can observe dark or bright solitons. This soliton simulation is an example of a soliton moving to the right at a speed , determined entirely by the initial condition. If you change the value of and restart the simulation, you can observe different behaviours. For example, gives a defocusing equation, for which the soliton eventually breaks apart into something resembling a moving Jacobi elliptic function. We note that the simulator used does not preserve the conserved quantities in this model, so may give spurious or incorrect solutions for some parameters or initial conditions. Coupled Ginzburg–Landau systems We can also consider generalisations of coupled systems, particularly an optics formalism known as 'cross-phase modulation'. Models of this form with cubic nonlinearities look like The parameters and influence how much the two wavefunctions interact with one another. If these interactions are strong, either species can be driven to extinction, as described in a 2019 paper on amplitude death. In intermediate cases, the two wavefunctions may coexist, leading to dynamics where the wavefunctions are nonzero only in separate subsets of the domain, as described in a 2018 paper on saturable nonlinearities. This separation simulation explores these dynamics, where the wavefunctions are locally chaotic but their boundaries are determined by where the other wavefunction is nonzero. Toggle between the amplitudes of each wavefunction by clicking and selecting one wavefunction or the other. ","url":"/nonlinear-physics/nls-cgl","tags":"","img":"/assets/images/complexGinzburgLandau.webp","id":34},{"layout":"page","title":"Bending in nonlinear beams","lesson_number":110,"thumbnail":"/assets/images/nonlinear-beam.webp","extract":"Exploring state-dependent stiffness","equation":"","body":"In the absence of inertia, the dimensionless equation of motion for a beam with a small deflection is where represents the stiffness of beam, or how difficult it is to bend. Traditionally, this stiffness is taken to be a constant or perhaps to depend on the position . In the simulation below, we consider a beam with a stiffness that depends on the local curvature, so that for baseline stiffness , stiffness change , and sensitivity . We can play with using the slider below. The minimum value corresponds to a beam with constant stiffness, while the maximum value corresponds to a beam with a stiffness that depends strongly on the curvature. A quick exploration highlights that the dynamics of the beam depend significantly on the differential stiffness. Play with this example in more detail in this customisable simulation. ","url":"/nonlinear-physics/nonlinear-beams","tags":"","img":"/assets/images/nonlinear-beam.webp","id":35},{"layout":"page","title":"The Perona–Malik equation","lesson_number":90,"thumbnail":"/assets/images/PeronaMalik.webp","extract":"Image denoising via nonlinear anisotropic diffusion","equation":"","body":"Here is an implementation of the Perona–Malik equation, which is used for image denoising. In particular, the nonlinear anisotropic diffusion causes sharp gradients to sharpen, and smooths out more shallow noisy regions. Load the interactive simulation: it starts with some text from a quote by Bernt Øksendal, with some noise added on top of it. Press to cause the initial condition to sharpen, making the text clearer. You can pause the simulation and use the brush to add more noise to the image. Play with the parameter to see how it influences the ability to denoise the text. You can change the image to one of a noisy aperiodic tiling by modifying the initial conditions to use rather than , and then restarting the simulation. Other images will also work, but these may need some fine-tuning to have this algorithm improve their quality. In particular, finer meshes may be needed to preserve small edges. ","url":"/nonlinear-physics/perona-malik","tags":"","img":"/assets/images/PeronaMalik.webp","id":36},{"layout":"page","title":"Stochastic partial differential equations","lesson_number":120,"thumbnail":"/assets/images/stochastic-pdes.webp","extract":"Randomness in time and space","equation":"","body":" Stochastic pattern formation First we consider a stochastic version of the Gray–Scott model given by where is an approximation of a Brownian sheet, representing noise in both space and time, so its derivative is understood in the sense of stochastic calculus. Load the interactive stochastic reaction–diffusion model The model is initially deterministic (), so the initial condition simply spreads out to make a homogeneous state across the domain. Clicking indicates that this homogeneous equilibrium is stable, even to large perturbations. Increasing the value of in the range , we can observe that noise destabilises this equilibrium, forming stripe and spot-like patterns. This is an example of stochastic resonance in reaction-diffusion systems. Smaller values of will select for stripes, and larger for spots. Further increasing to the value of or so will destroy these patterns, as the noise eventually destabilises everything. This is sometimes known as stochastic extinction or random attractor collapse. Wave propagation through a random medium Next we consider a version of the inhomogeneous wave equation where the diffusion coefficient is a random function of space, where is a smoothed spatial random variable approximated as a Gaussian with mean and variance which scales with . Load the interactive random wave equation Click to initiate a wave at some point in the domain. The default noise level is . If you change this value and restart the simulation by pressing , you can observe deterministic wave propagation for small values of , and noisier wave behaviour for larger values. Stochastic vegetation waves Consider a stochastic version of the Klausmeier model in 1D of the form: Load the interactive stochastic Klausmeier model The parameter represents the strength of the noise, so increasing or decreasing it will lead to more stochastic or more deterministic behaviour, respectively. The noise function should scale correctly independently of the geometry and dimension. You can see how it behaves in 2D by pressing Domain and change Dimension from 1 to 2. Playing with as well as other parameters, and clicking to perturb the waves, shows that irregularity of the waves can occur in different ways with stochastic forcing. Numerical health warning Randomness and stochastic forcing can lead to less regularity and stability of numerical schemes. Warning: the method only works for the forward Euler timestepping scheme! All other timestepping schemes will not scale properly with the timestep. In implementing our random noise terms, we have taken with and the space and time steps respectively, and is the number of dimensions. The variable represents (for each spatial point and every time step) an independently distributed normal random variable with mean and variance . The scaling in time is to preserve the Brownian increment scaling of after the multiplication by from the forward Euler stepping. Similarly, we take to scale the same way in space, but it will not scale with time. We also mollify by running a diffusion smoothing on it for a short time. ","url":"/nonlinear-physics/stochastic-pdes","tags":"","img":"/assets/images/stochastic-pdes.webp","id":37},{"layout":"page","title":"Swift–Hohenberg equation","lesson_number":10,"thumbnail":"/assets/images/swiftHohenberg.webp","extract":"Simplistic pattern formation","equation":" with periodic boundary conditions","body":"Swift–Hohenberg equation: with periodic boundary conditions, and we need (or if ) for stability. Load the interactive simulation. Depending on the signs of , , and , this system can support a wide range of patterns and dynamical behaviour. One important class of behaviour is subcriticality, where the dynamics of the system can become quite complicated and include things like multistability of homogeneous and patterned states, and localised solutions as described below. Localised solutions When , , and , the system can be in a subcritical regime that supports both stable patterned states and the stable homogeneous state . Specific initial conditions can induce localised patterns, which fall off to the background of throughout most of the domain. Load this localised simulation as one example. Change the initial conditions or click to induce localised structures throughout the domain: see that these structures only materialise if they are sufficiently far from the homogeneous state (as otherwise perturbations will decay back to it). This example is based on a 2023 paper by Dan Hill and collaborators which studies symmetric localised solutions of the Swift-Hohenberg equation. The default initial condition picks out a solution with symmetry. If you change the parameter to the value and then press , this will replace the initial condition with one that evolves to a hexagonal solution ( symmetry). If you set and press , this will replace the initial condition with one that evolves to a -symmetric solution. ","url":"/nonlinear-physics/swift-hohenberg","tags":"","img":"/assets/images/swiftHohenberg.webp","id":38},{"layout":"page","title":"Hyperbolic reaction–diffusion systems","lesson_number":100,"thumbnail":"/assets/images/FHNTuringWave.webp","extract":"Turing wave instabilities","equation":", ","body":"One can show that two-species reaction–diffusion systems can only ever have Turing-like instabilities with real growth rates. In contrast, hyperbolic reaction–diffusion systems (or systems with more than two species) allow for Turing and wave (or sometimes wave or Turing–Hopf) instabilities. Such instabilities lead to spatial eigenfunctions that grow and oscillate, typically giving rise to spatiotemporal dynamics. Here we consider a hyperbolic version of the Brusselator, given by where there are two new terms proportional to . The normal Turing instabilities will occur for , so we set and . In a one-dimensional simulation, an initial cosine perturbation on a small domain leads to an oscillating cosine, which is what linear theory would predict. The system loses this instability as is decreased to or below, with a decaying oscillation amplitude for intermediate values. On a larger domain, a two-dimensional simulation exhibits a variety of transient dynamics depending on exactly how the uniform equilibrium is perturbed, culminating in wave–like spatiotemporal behaviour. Again decreasing or increasing will reduce the effect of the instability, decreasing the amplitude of the solution. Here is a different 1D example and the same system in 2D based on the FitzHugh–Nagumo system. For more details on such systems and their generalisations, take a look at this 2022 paper. ","url":"/nonlinear-physics/turing-wave","tags":"","img":"/assets/images/FHNTuringWave.webp","id":39},{"layout":"page","title":"Validating VisualPDE","lesson_number":10,"thumbnail":"/assets/images/ValidatingVisualPDE.webp","extract":"VisualPDE versus exact solutions","body":"When implementing VisualPDE, we were somewhat sceptical of browser-based computation and questioned if it could be relied upon, especially in the context of PDEs. Here we showcase some of the examples that have convinced us of VisualPDE's surprising accuracy. The heat equation Perhaps the simplest equation that VisualPDE can solve is the heat equation, as explored in this detailed example. With as the temperature in an infinite domain, the heat equation admits solutions of the Gaussian form Hence, if the initial data is Gaussian, the solution evolves as a Gaussian. We can simulate this scenario in VisualPDE by truncating the infinite domain (applying Neumann boundary conditions) and specifying initial data of this form. Note that the exponential solution decays rapidly to zero far away from the mean of the Gaussian, so that the finite-domain approximation is a very good one. This heat equation simulation is set up to do just that. To check if the numerical solution is accurate, we've plotted the analytical solution (thin curve) on top of the numerical one (thick curve). As you might have hoped, VisualPDE does an excellent job of capturing the spatiotemporal evolution of the exact solution. This is especially remarkable as this particular simulation uses a fairly coarse spatial discretisation and a forward Euler timestepping scheme. If you turn on Auto snap: Auto snap and wait until , you'll actually start to see the plotting of the analytical solution break down due to the implementation of the exponential function on your GPU, and the two solutions begin to separate. The wave equation In our first look at the wave equation, we saw how we can cast this hyperbolic PDE in an approximate parabolic form that can be solved by VisualPDE. The true wave equation in 1D, written as for amplitude , has simple solutions if initially, composed only of leftward and rightward travelling waves. The exact form can be found easily using d'Alembert's solution. In this wave equation simulation, we numerically solve our close approximation to the wave equation with stationary initial data, plotting the exact solution on top. As before, we observe very good agreement between the two solutions. As expected, this agreement lessens over time as the effects of our approximation accumulate. Reducing the regularisation parameter improves this agreement, but setting it to zero causes spurious oscillations to eventually emerge in the numerical solution. A conservative system As VisualPDE is designed to solve a broad range of PDEs, it often fails to precisely capture conserved quantities in special systems. The Schrödinger equation is a good example of this, explored on the Schrödinger page. In this alternative simulation, try changing the timestepping scheme and restarting the simulation. As might be expected, higher order schemes like the midpoint method and Runge-Kutta 4 do a better job of preserving the total integral of the system (which should be unity) than the (default) forward Euler method. To get a handle on this quantitatively, we've enabled Auto pause: Timestepping Auto pause which stops the simulation at a specified time so that you can compare the values obtained with each of the numerical schemes.","url":"/numerical-methods/validating-VisualPDE","tags":"","equation":"undefined","img":"/assets/images/ValidatingVisualPDE.webp","id":40},{"layout":"page","title":"FAQs","lesson_number":15,"thumbnail":"/assets/images/question-marks.webp","extract":"Unsure about something? Help is at hand","body":" --- Sharing and citing How do I cite VisualPDE in my article? The VisualPDE paper is out! You can find it online for free and cite it as Walker, B.J., Townsend, A.K., Chudasama, A.K. et al. VisualPDE: Rapid interactive simulations of partial differential equations. Bulletin of Mathematical Biology 85, 113 (2023). Am I allowed to make and share content using VisualPDE.com? Yes! We would love to see you making and sharing content using VisualPDE. We ask that any content you create somehow points back to VisualPDE.com – a great way to do this is to share a link directly to your simulation! Feel free to use VisualPDE in articles, images, videos, scientific works, social media posts, etc. I want to share my cool simulation – how do I do this? VisualPDE is designed for sharing. Whether you've fallen in love with one of our examples or you've crafted your own using the VisualPDE interface, you can share the current simulation using a link. Simply open the share sheet by clicking and click 'Copy link' to put a URL on your clipboard that you can share anywhere by pasting! It's that easy! These links can be quite long, so we recommend using a (free) shortening service like tinyURL.com if you want a concise link for sharing. How do I take a pretty screenshot or video without all the user interface showing up? Screenshots and videos are simple in VisualPDE. Simply open the share sheet by clicking and click 'Save image' to download a screenshot to your device, or 'Record clip' to begin a recording that will download to your device when done (we recommend Chrome or Firefox for this). Recordings can be up to 60s long and will stop before then if you pause the simulation or click How do I make my videos compatible with social media and messaging apps? Different services accept different types of video, so compatibility is hard. Even worse, different browsers can only create certain types of video, so universal video compatibility is essentially impossible for us at VisualPDE. Fortunately, there are simple ways to convert video so that it is compatible with your favourite services. If you want a quick solution, ffmpeg-online will do this for you. Just drag and drop your video, ignore the rest of the boxes and hit the run button to generate a compatible video file. Even better: your video never leaves your device. If you prefer a command line solution, then ``ffmpeg`` is once again your friend. If you have ``ffmpeg`` installed, running ``ffmpeg -i FILENAME output.mp4`` will almost certainly save a compatible copy of your video (``FILENAME``) as ``output.mp4``. Don't just take our word for it - try it out! Can I embed VisualPDE in my own site? Yes you can! Clicking and then 'Embed' will put an iframe element on your clipboard that points to the current simulation. You can specify the complexity of the user interface that you want to be visible, selecting from the full experience, the minimal interface used in our Visual Stories, or no user interface at all. If you do this, we'd love to hear from you at hello@visualpde.com so we can check out your site and your simulation! In principle, you can have as many embedded simulations on your site as you want. In practice, having lots of simulations running at once might cause stuttering on some devices. You can mitigate this by pausing simulations (VisualPDE consumes very few resources when paused) or by only showing a limited number of simulations onscreen at any one time (simulations that are out of view are automatically paused by your browser). You can also make your simulations less computationally demanding by reducing the number of timesteps per frame or the domain size. --- Errors Sometimes, mistakes happen. If something has gone wrong, VisualPDE will try its best to describe the error in a helpful way via a pop-up. We try to display a helpful error message to help you identify the problem. More cryptic messages are listed below. Undeclared identifier ``` ERROR: 0:87: 'k' : undeclared identifier ``` Here, the quantity 'k' has been used somewhere in one of the many free-text inputs in VisualPDE, but it hasn't been defined. The most common cause of this is using a parameter in the Definitions tab without defining it in the Parameters tab. Check your definitions and parameters to resolve this. Be careful to define parameters as constant numbers – dependence on other parameters, space, time, or species is not (yet) supported! Cyclic variables/parameters detected ``` Cyclic variables/parameters detected. Please check the definition(s) of a,b. ``` This error arises when the definitions of your variables or parameters mean that they depend on each other in a cyclic way that can't be resolved. For example, imagine parameters and are defined as There is no solution to this system of equations, so check your definitions and try again. My error looks nothing like any of these Sometimes, errors won't look anything like these examples. If this is the case and the error message doesn't help you in resolving it, please follows the steps outlined below and help make VisualPDE as stable as possible! NOTE: VisualPDE sometimes won't warn you about multiple errors that involve the same error message (we're working on it). So, if you fix an error involving 'k', you might not be warned about later errors involving 'k' in the same session. Reloading the page (making sure to have copied your configuration URL first!) is a good way of getting around this for now. The buttons don't work, but I want to keep playing! Very rarely, the simulation and the user interface may become unresponsive. If this happens: 1. Click to bring up the user guide to try to solve your problem. 1. Reload the page. Sadly, this won't preserve the configuration beyond that specified in the URL. If the issue is persistent and you're confident that you've followed all the steps outlined in this guide, please report your issue as described below. How do I report an issue? Sometimes, something might go wrong (e.g. a part of the user interface is doing something strange, or the simulations are not working on your device). If you encounter an issue that can't be resolved using the User Guide, we'd love to hear from you at bugs@visualpde.com. If you can, it will help us a lot if you could click Misc. Debug Copy debug and paste the contents into your email. This will contain information about your current configuration that will help us resolve the problem. --- Beyond VisualPDE.com I want to use VisualPDE in my teaching/research/outreach – what do I do? VisualPDE is designed for customising and sharing. If you're new to the site, we recommend that you play around and work through the examples found in Introductory PDEs to get an idea of how to craft your own simulation, and make use of link sharing to permanently save customised simulations. For instance, a popular way to create custom teaching materials is to simply include links to customised VisualPDE simulations in more traditional teaching materials, similar to the examples on the site. If you want to do more than this allows, we'd love to hear from you at hello@visualpde.com so that we can help bring VisualPDE into your teaching, research, or outreach activities. I want to use VisualPDE for my business - can I? Almost certainly! However, we want to make sure that we do knowledge exchange properly, so do get in touch with us at hello@visualpde.com so that we can make sure you'll get the best out of VisualPDE. I've got a feature request – who do I contact? We're always looking to improve VisualPDE and would love to hear from you at hello@visualpde.com if you think we can improve something about the experience. If you'd like to suggest a brand new PDE for the website, we're looking for examples that are qualitatively different to what is already on the site. That being said, if you've found a cool parameter set for a system that we haven't noted already, do let us know! If you can't seem to cast your PDE in a form that VisualPDE can solve, we encourage you to look at the examples in Introductory PDEs to see how various types of PDE can be thrown into VisualPDE, which might provide some inspiration. If you still can't get VisualPDE to solve your system but you think it should/could be possible, we'd love to hear from you. Can I modify the source code of VisualPDE and host my own version? In short: yes! We've made VisualPDE open source for a reason and want to see as many people using it as possible. If you want to ship your own version of the source code, we ask that you follow the licences found in our repository and provide due credit to VisualPDE.com. If you're in any doubt about your specific case, do send us an email at hello@visualpde.com and we'll happily chat with you! We're all about making VisualPDE accessible to as many people as possible.","url":"/user-guide/FAQ","tags":"","equation":"undefined","img":"/assets/images/question-marks.webp","id":41},{"layout":"page","title":"Advanced documentation","lesson_number":20,"thumbnail":"/assets/images/Brusselator.webp","extract":"A glossary of all the features you can play with","body":"Almost everything in VisualPDE is customisable. Here, we describe the basic functionality of every option that can be found in the menus of VisualPDE. --- Equations VisualPDE is all about solving equations. In the Equations pane, you can view and define the problem that VisualPDE will solve for you in your browser, complete with initial and boundary conditions. More advanced settings, including variable renaming, can be found under Settings. Edit Customise all the terms in the PDEs that you would like to solve using natural syntax. See our discussion of valid expressions for helpful examples that will guide you in posing your own PDE system. Typing in any of the fields will highlight the corresponding term in the typeset PDE above. - Typeset Have VisualPDE typeset the specified equations, making use of all the defined diffusion coefficients, functions and parameters. Terms will not be substituted in if they are constants that are not 0 or 1. Toggle this off to see the format of the equations that VisualPDE can interpret. - , , , ... Set the diffusion coefficients of all the species in the simulation. When Cross diffusion is enabled, you can also set interaction terms, which are written etc. These can be functions of space (, ), time (), any of the unknowns (, , , ), the size of the domain (, , ), the images (, ) and any quantities defined in Parameters. See our discussion of valid expressions for valid syntax and a list of available in-built functions. Advanced users seeking diagonal anistropic diffusion tensors (i.e. distinct diffusion coefficients in the coordinate directions) can define two coefficients at once by separating definitions with a semicolon. For example, `1;2` sets diffusion coefficients of `1` and `2` in the and directions, respectively. - , , , ... Define the inhomogeneities in the equations. These can be functions of space (, ), time (), any of the unknowns (, , , ), the size of the domain (, , ), the images (, ), and any quantities defined in Parameters. See our discussion of valid expressions for valid syntax and a list of available in-built functions. Advanced users can also make careful use of `RAND`, a uniformly random value in , and `RANDN`, a normally distributed random number with unit variance and zero mean. This converts the equations into stochastic partial differential equations, which should only be solved using the Forward Euler timestepping scheme. Both `RAND` and `RANDN` require manually dividing by `sqrt(dt)` in non-algebraic equations so that the scheme resembles the Euler-Maruyama method. The solution under other timestepping schemes is undefined. For convenience, we define `WhiteNoise` to be a normally distributed random variable with unit variance and zero mean, scaled by where is the spatial dimension. This scales appropriately with timestep and spatial step and is suitable for direct use in PDEs, such as in our stochastic example. Parameters This menu contains a list of all the user-specified values that can be used throughout VisualPDE. New parameters can be defined using the empty input field at the bottom of the list of parameters. Parameters can depend on one another, but their definitions cannot be cyclic. Basics The basic syntax for defining a parameter is ``` name = value ``` which will make the quantity `name` available to the simulation. You can then freely change `value`, which will instantly propagate throughout VisualPDE. If you try to use a name that clashes with an internal variable (some of which are only found under the hood of VisualPDE), a warning will appear to inform you of this. Parameters can be removed by deleting the text that defines them. You can even choose a `name` that includes subscripts, such as `k_1u`. This will be interpreted as automatically by VisualPDE. Sliders The more advanced syntax ``` name = value in [start,step,stop] ``` creates a slider for your variable, ranging between the `start` and `stop` values in increments of `step`. The `step` parameter can be omitted and VisualPDE will choose a step automatically. For example, ``` a = 0.5 in [0,1] ``` creates a slider that ranges between 0 and 1, with initial value 0.5 and an automatically determined step size. Parameters with sliders cannot be defined in terms of other parameters. The configuration of a slider (value, start, step, stop) can be updated by modifying the relevant parts of the expression that defines it. Sliders can be removed by deleting `in ...` from the parameter definition, and will be removed automatically when the associated parameter is removed. Boundary conditions Boundary conditions can be specified for any species in the simulation. The following boundary conditions are available: - Periodic - Dirichlet (e.g. ) - Neumann (e.g. ) - Robin (e.g. ) Boundary conditions that allow you to specify values can be functions of space (, ), time (), any of the unknowns (, , , ), the size of the domain (, , ), the images (, ) and any quantities defined in Parameters. Robin boundary conditions are the only type supported that allow you to use an unknown in the specification of its own boundary condition. See our discussion of valid expressions for valid syntax and a list of available in-built functions. An additional option, Mixed..., is also available, which allows you to specify different types of boundary condition on the Left, Right, Top and Bottom sides of rectangular domains. The easiest way to do this is using the graphical interface by clicking beside the boundary condition selector (unavailable during surface plots). Click the various boundaries to set the desired condition on each. These conditions can also be specified directly as a string, e.g. ``` Left: Dirichlet = 0; Right: Neumann = 1; Top: Robin = u; Bottom: Dirichlet = sin(x) ``` for the species would specify on the left boundary, on the right boundary, on the top boundary and on the bottom boundary. Sides can be specified in any order and are case sensitive. Omitting any side will default to periodic boundary conditions (beware, this may have unexpected results if the matching side is not also periodic; using the graphical interface prevents this). An additional type of condition, 'Ghost', can also be specified with Mixed boundary conditions. This advanced option pushes VisualPDE to its limits, overriding the value of the ghost nodes used in the spatial discretisation of the PDE, and should be used with caution. We make use of this option in our Visual Story on virus transmission to effectively double the size of the computational domain in one direction. This must be toggled on in Misc. Initial conditions Initial conditions can be specified for any species in the simulation. They can be functions of space (, ), the size of the domain (, , ), the images (, ), the random quantity `RAND`, a uniformly random value in , the random quantity `RANDN`, a normally-distributed random number with unit variance and zero mean, and any quantities defined in Parameters. See our discussion of valid expressions for valid syntax and a list of available in-built functions. Advanced options Configure additional equation-related settings, including the number of species and the type of terms that will be included. - Num. species Specify the number of unknowns (1, 2, 3, or 4) in the simulation. - Num. algebraic Choose how many equations you want to be in algebraic form in systems with cross diffusion enabled. The equations will be put in algebraic form in reverse order, e.g. a 4-species system with 1 algebraic species will convert the final equation to be algebraic. - Species names Specify custom names for the species in VisualPDE, which often default to , , , . Names can be multi-character and can include letters, numbers, and underscores, but must each be a single 'word'. For example, `T_01` is a valid name (rendered as ) whilst `T 01` is not. Space or commas can be used to separate names in the list. Certain names are reserved under the hood, such as `H` for the Heaviside function, but VisualPDE will warn you if you attempt to use a reserved name. VisualPDE will automatically substitute the names of old species everywhere in the simulation and interface. - Cross diffusion Enable cross diffusion in systems with 2 or more species, enabling simulation of a wide range of systems in which a species can depend on the gradient of another. - Scales Set per-equation timescales (multiplying any time derivatives) , , , to enable simpler entry of some types of systems. For algebraic equations, these quantities are no longer timescales, but retain their notation and function as per-equation scale factors. They can be functions of space (, ), time (), any of the unknowns (, , , ), their gradients (, , etc.), the size of the domain (, , ), the images (, ), and any quantities defined in Parameters. See our discussion of valid expressions for valid syntax and a list of available in-built functions. Importantly, timescales must be non-zero. Setting timescales to zero will result in singularities and are equivalent to large diffusion coefficients, large timesteps, or fast kinetic terms. --- Views There are often multiple ways to visualise a solution to a PDE. In the Views pane, you can select from and customise a range of example-specific display options, or create your own. Everything you customise will be saved in the current View. If you share your simulation via a link, your Views will be sent along too. New (+) Create a new view with a placeholder name from the current view configuration. Rename Edit the name of the current View, enclosing any mathematics in `uvwqxytuvwqu_xu_yLL_xL_yI_SI_Txytuvwqu_xu_yLL_xL_yI_SI_Tz(x,y)zxytuvwqLL_xL_yI_SI_T\\theta\\phi\\theta\\in[0,\\pi]\\phi\\in[0,2\\pi]LxyxyxytuvwqLL_xL_yI_SI_TxytuvwqLL_xL_yI_SI_TxytLL_xL_yxyxByBtuvwqLL_xL_yI_SI_TxytuvwqLL_xL_yI_SI_T[0,1]xytuvwqLL_xL_yI_SI_TuvwqyyL\\dx=\\dy\\floor{L / \\dx}\\dx\\dx=\\dy\\dtxyxy(x_{min}, y_{min})(0,0)(L_x/2, L_y/2)L_xL_y\\domainx<0.5x-0.5xytuvwqLL_xL_yI_SI_T\\dt\\dxtI_SI_TI_SI_TL_xL_yxyxy[-1,1]u(X, Y)(X,Y)xy$ directions, with zero correlation. Correlation can be specified via `Gauss(X, Y, s_x, s_y, r)`, where `r` is the correlation between the two directions. ","url":"/user-guide/advanced-options","tags":"","equation":"undefined","img":"/assets/images/Brusselator.webp","id":42},{"layout":"page","title":"Quick start","lesson_number":10,"thumbnail":"/assets/images/start.webp","extract":"Two-minute top tips","body":"VisualPDE is a web-based set of tools for solving partial differential equations (PDEs) via an interactive, easy-to-use simulation. To get started, try playing with some of the examples in Introductory PDEs, or read on for some quick tips for using the solver. Interacting with the simulation Clicking/pressing on the simulation draws values right onto the domain. You can customise exactly what this does under Brush For example, the default settings in the heat equation example allow you to paint 'heat' of value 1 onto the domain, which acts like an initial condition for the rest of the simulation. The equations panel Pressing opens up the equations panel. {:refdef: style=\"text-align: center;\"} !Equations panel{: width=\"253px\" border=\"1px black\"} {: refdef} Here you can: See the equation being simulated, here . Set the named functions in the equations, here and , under Definitions. These can be functions of any of the unknowns, space, and time (here , , , and ), and of any parameters that will be defined further down the panel. Set the value of any extra parameters. Set the boundary conditions. Set the initial conditions. Set the number and type of equations to be solved. Domain shape The default domain for solving PDEs is a 2D rectangle, , which fits the size of your browser window or phone screen. Throughout VisualPDE, we use coordinates and . You can force the domain to be a square, , by toggling off Domain Fill screen Boundary conditions The following boundary conditions are available to allow you to set the value of the function, or the value of its derivative, along the boundary of the domain : Periodic Dirichlet (e.g. ) Neumann (e.g. ) Robin (e.g. ) You can swap between boundary conditions by choosing Boundary conditions and selecting from the list for each variable. Initial conditions You can specify the values to which the unknowns (, , ) are initialised when resetting the simulation. These expressions can be functions of , , the special string 'RAND' that assigns a random number in [0,1] to each point in the domain, along with any user-defined parameters and the images and (see the advanced documentation for more details). You can also use , and . Changing the equations The simplest system VisualPDE can solve is a single PDE, where and are functions of , , , and that you can specify. The most complicated type is a coupled system of PDEs in four unknowns, , , and : where , and are functions of , , , , , and that you can specify. You can change the number of unknowns by choosing Advanced options Num. species In systems of multiple unknowns, you can include terms representing cross-diffusion (e.g. , ) by toggling Advanced options Cross diffusion In systems of multiple unknowns, you can choose between a differential or algebraic equation for some of the species (e.g. '' or '') by toggling Advanced options Algebraic w (or v or q) More VisualPDE For a comprehensive list of all the options that you can set in VisualPDE, check out the Advanced documentation, or discover what VisualPDE can solve in our brief summary. ","url":"/user-guide/quick-start","tags":"","equation":"undefined","img":"/assets/images/start.webp","id":43},{"layout":"page","title":"The VisualPDE solver","lesson_number":40,"thumbnail":"/assets/images/UnderTheHood.webp","extract":"Under the hood of VisualPDE","body":"VisualPDE aims to be a plug-and-play, browser-based solver and visualiser for a range of PDE systems, with as few barriers to entry as possible. Underneath what we hope is a polished exterior, we've made a number of somewhat technical choices to enable interactive and reliable solution across as many devices as we can support. To explain these choices, and because we like knowing what's going on inside any software we use, we've compiled a short summary of how VisualPDE works under the hood. This is accompanied by a more detailed account in an open access article. We are always looking for ways to improve and extend VisualPDE, especially ways of reaching a broader audience and new communities. If you have any questions or suggestions about anything related to VisualPDE, we'd love to hear from you at hello@visualpde.com! The equations VisualPDE can solve a variety of PDE systems posed in 1D or 2D space, many of which are straightforward extensions of the two-species reaction–diffusion system, Here, and are the scalar unknowns that we solve for, is time, and the divergence and gradient operators are the usual spatial operators in a 2D Euclidean domain. In general, the interaction/kinetic terms ( and ) and the diffusion coefficients ( and ) can each be functions of time, space, and the unknowns, though we often don't explicitly write these potential dependencies. See this help page for a comprehensive summary of the types of PDEs that VisualPDE can solve. The domain A PDE problem is not well-posed without specifying a domain (or boundary conditions). We typically determine the domain from the size of your device, fixing the largest side to be of length . You can demand a square domain with aspect ratio 1:1 by toggling Domain Fill screen However, not all domains are rectangular. To accommodate this, VisualPDE allows you to specify an arbitrary domain via a level set or indicator function approach, under Domain Implicit To make this work in practice, VisualPDE uses this user-specified function to determine which parts of to include in the simulation, though this prevents you from specifying boundary conditions that include derivatives (computing normals to user-specified curves is not something we wanted to think about). You can specify a boolean (e.g. ) or a simple expression (e.g. ), where (strict) positivity identifies the interior of the domain. You can even use images in this expression, allowing you to define complicated domains with ease. Spatial discretisation We take and divide it into a square grid with a user-configurable spacing. Be warned: the only limit to this spacing is your imagination/hardware, so taking a spatial step of is unlikely to be a good idea... We use this grid in a finite difference scheme to approximate the spatial operators in our system. If and were simply constants, as they were when we began the development of VisualPDE, a standard central differences discretisation of the resulting Laplacian would suffice. However, as these coefficients generally vary in space, we employ a similar but necessarily more complex scheme. Explicitly, using as an example and limiting ourselves to 1D for brevity, we approximate at a point , where we've omitted any dependence of any quantities on anything other than space. Notably, this is just a standard central differences scheme if is constant. Adding the above to itself with replaced with gives the 2D discretisation, and adding in additional terms is simple by linearity. Timestepping With space discretised as above, we are faced with a large system of coupled ordinary differential equations to solve, which represent the evolution of the unknowns at each discrete gridpoint of the spatial domain. VisualPDE implements four popular schemes for timestepping: Forward Euler, two-step Adams-Bashforth, the Midpoint Method and the four-step Runge-Kutta method (commonly known as 'RK4'). These solvers each have their strengths, with Forward Euler being the least computationally demanding while RK4 offers superior accuracy and stability at the cost of doing more calculations each timestep. The following Forward Euler scheme is the default in many of the examples on the site: for timestep . This approach is far from state-of-the-art, but it is straightforward and intuitive to implement on massively parallel computing hardware (more on that later). In practice, its simplicity can lead to some problems, with numerical instability being perhaps the most pathological. Loosely speaking, the interaction between the forward Euler scheme and our spatial discretisation can lead to numerical artefacts ruining the solution, which typically occur when the ratio is too small, where is any of the diffusion coefficients in the problem. Both the Midpoint Method and RK4 improve upon the stability of Forward Euler, whilst the Adams-Bashforth scheme is generally less stable but more accurate than Forward Euler. VisualPDE will try to tell you when it's fallen foul of stability issues (we periodically check for 'NaN' or in the solution), at which point you might want to try reducing , trying out a different solver, reducing the diffusion coefficients in your problem, or increasing (we recommend trying each of these things in this order). If you want to experience this for yourself for Forward Euler, try clicking in this simulation. It turns out that only RK4 will make this simulation stable due to the relative size of the diffusion coefficient, timestep and spatial step , which you can see for yourself by switching the timestepping scheme. Despite each of our solvers having their limitations, these schemes have enabled VisualPDE to efficiently solve every system that we've thrown at it, though some tuning of the timestep can be necessary in extreme cases. If you have any tips for implementing alternative schemes (especially anything implicit), we'd love to hear from you! Boundary conditions VisualPDE implements four types of boundary condition: periodic, Dirichlet, Neumann, and Robin. As each of these are slightly different in character, we briefly describe the general form of each condition that can be used in VisualPDE, along with notes on how this is enforced in the simulation. We pose these conditions as if they correspond to the scalar heat equation in 2D. Periodic Periodic boundary conditions, where etc, are the simplest to implement. If our spatial discretisation is attempting to sample a function outside of , we simply map its argument back to by shifting by or . Dirichlet Dirichlet boundary conditions take the form for a user-specified function . These are easy to enforce, as we simply override our usual timestepping for any nodes on the boundary of the domain. If the user has chosen to use an implicitly defined domain, we assign to all points outside of . Neumann Neumann boundary conditions are specified as for a user-specified function , where denotes a derivative in the direction of the (outward-pointing) normal to the boundary. Implementing a Neumann boundary condition is done via so-called ghost nodes in our discretisation. For instance, enforcing at the left-most boundary of a rectangular domain is achieved in practice by taking in the finite difference operator described above. Robin Robin boundary conditions are a natural combination of Dirichlet and Neumann conditions, which we pose in the form of a generalised Neumann condition , where the right-hand side can now depend on (and any other unknown in multi-species systems). These conditions are also implemented with ghost nodes. For example, enforcing at the leftmost boundary of a rectangular domain is achieved in practice by taking in the finite difference operator described above, approximating the derivative at the boundary with a simple central difference. Combined VisualPDE also allows you to specify different boundary conditions on different parts of the boundary. Doing this requires some special syntax, as detailed in the advanced documentation. Doing this in your browser, quickly Solving PDEs is hard. To solve them in real time in your browser, VisualPDE gives all the hard work to the graphics chip (GPU) on your device, making use of WebGL and a low-level shader language called GLSL. Every time your browser requests a frame from VisualPDE (which might be up to 60 times per second), some JavaScript organises the solving of the discretised equations, displaying the solution, and incorporating anything you've drawn, which all happen on the GPU. Each frame, we typically perform hundreds of timesteps to give you a smooth experience, mitigating many of the limitations of our timestepping schemes. If you're interested in the finest details of the implementation, the source code for the entire site is freely available to view, reuse, and repurpose on GitHub. Accuracy and precision VisualPDE hopes to be as accurate as possible whilst providing a responsive, visual, portable platform for solving PDEs. In most systems, the timestep, timestepping scheme and spatial discretisation will be the main source of any errors, as you'd expect from finite-difference discretisations of PDEs. Naturally, smaller timesteps, higher order timestepping schemes and refined spatial discretisations will often improve the accuracy of the solution, but each will incur additional computational costs. With VisualPDE, you can choose the balance that works best for you (and potentially your audience). A more subtle limit on the accuracy of VisualPDE is our use of single-precision arithmetic, something we've inherited from the libraries we use and the capabilities of modern hardware. We'll be moving to double-precision computation as soon as we can to maximise the accuracy of VisualPDE. In the meantime, rest assured that single-precision arithmetic is sufficient for capturing a wide range of phenomena, including those explored in our examples, but keep this caveat in mind when seeking to find precise quantitative answers to PDE problems. ","url":"/user-guide/solver","tags":"","equation":"undefined","img":"/assets/images/UnderTheHood.webp","id":44},{"layout":"page","title":"What can VisualPDE solve?","lesson_number":30,"thumbnail":"/assets/images/squirrel-question.webp","extract":"A brief intro to the systems we simulate","body":"VisualPDE solves systems of PDEs that look like generalised reaction--diffusion equations. It can do this in 1D or 2D. The simplest type of system is just a single PDE in a single unknown, , where and are functions of , , and space that you can choose. For example, if and is a constant, you have the heat equation. The most complicated type is a coupled system of PDEs in four unknowns, , , and : where the diffusion coefficients ( etc.), the timescales ( etc.) and the interaction/kinetic terms (, , , ) can depend on the unknowns, space, and time. In matrix form, we can summarise this by saying we solve systems of the form where is a vector of one, two, three or four unknowns, is a diagonal matrix with potentially some zeros on the diagonal; you might know this as a 'mass matrix', is a possibly non-constant matrix that may contain zeros; you might know this as a 'diffusion tensor', is a vector of one, two, three or four components that contains our interaction or kinetic terms. VisualPDE allows you to easily change the number of components and the boundary conditions. You can set initial conditions just by clicking the screen. ","url":"/user-guide/what-can-visualpde-solve","tags":"","equation":"undefined","img":"/assets/images/squirrel-question.webp","id":45},{"layout":"page","title":"Virus transmission","lesson_number":20,"thumbnail":"/assets/images/VirusTransmission.webp","extract":"Visualising airborne infections","equation":"","body":"Since the Covid-19 pandemic began, airborne viruses have formed a large part of scientific study. In this short Story, we're going to explore one aspect of this work: the effects of airflow. Before we begin, it's worth noting that the results of the simulations in this Story aren't meant to match up perfectly with reality, so we'll focus on qualitative features rather than on particular values. At the end of our exploration we'll point you towards the full science behind this Story, which includes discussions of the assumptions behind the mathematical model that inspired our Story. Suppose that lots of people are sitting in a sealed room and one of them is infectious. We'll assume that the infectious person is constantly producing virus-laden particles that spread out around them and lose their potency over time. The simulation below shows what this might look like. The colour corresponds to the concentration or amount of the virus in the air. With VisualPDE, we're not just limited to watching a simulation: we can interact with it too. Clicking in the room will introduce some viral particles to the air, as if someone with an infection had coughed (coughing is actually a lot more complicated and is the focus of lots of research). Try clicking to see what difference a cough can make. Though each cough introduces some virus to the room, it looks like it quickly decays away until we can't even tell it was there. So, does this mean we shouldn't be worried about a cough? Catching the virus To explore this further, let's look at the probability (or chance) of getting an infection, which is related but not equal to the virus concentration. Specifically, we'll look at the chance of catching the virus assuming that you'd been in the same location for the duration of the simulation. With VisualPDE, we can do this by switching to the Probability View by pressing and choosing 'Probability'. Here, the probability of being infected is large close to where we know the source of the infection is, right in the middle of the room. If you clicked in the room to simulate a cough, you should also see some high probabilities elsewhere. This shows that, even though the viral particles seem to disperse quickly after a cough, they make a significant difference to the probability of catching an infection near to the cougher. As you might expect, the probability of being infected increases with the amount of time that you're exposed to the virus. This time-dependent effect is especially visible when you click to cough while using the Probability View. To reset the simulation and see this clearly, press . What do you think will happen if you cough multiple times in the same spot? Test out your prediction with VisualPDE! Recirculation It's fairly rare for air to stay still. Let's see what effect the movement of air can have on the distribution of a virus and the chance of infection. In the simulation below, we've added in the effects of the air being blown from left to right, mimicking an air conditioner, with anything that reaches the right-hand side of the room being blown back over everyone's heads before being recycled back into the left-hand side. With this new air movement, it now looks like standing downwind of the infected person is a bad idea: particles carrying the virus are swept from left to right by the air current, and the probability of being infected is much higher on the right of the infected person. Eventually, the recirculation of the air means that viral particles reach even the left-hand side of the room, leading to a large zone in the room where the probability of infection is high. Remember, you can swap between Views to see the effects on both probability and concentration. Try clicking while viewing the concentration to really see how the air drives the spread of the virus in one direction then blows it back from right to left, recirculating the virus over the room. This is in stark contrast to the behaviour of a cough in the earlier flow-free room. Explore further by changing the direction of airflow using the slider beneath the simulation. A meandering infection People don't always stay still in the middle of rooms. Unsurprisingly, the movement of an infected individual can have a big impact on the spread of a virus. In the next simulation, we've set it up so that the source of the infection moves around the room, as if they were a waiter going between tables in a restaurant, perhaps. We've also turned off the air conditioner, so that the air in the room is still. The Probability View shows the build-up of a ring of likely infections as the infectious person circles the room. A quick look at the Concentration View shows their circular path, leaving a trail of viral particles behind them. In this scenario, what do you think happens if we turn on the air conditioner? The next simulation does just this. Start the simulation by pressing Now, instead of a nice clean ring of likely infections, we immediately see that people on the downwind side of the room are much more likely to be infected – people that had a lower chance of infection in a room with no air circulation. If we keep watching, we can see this effect increasing and increasing. Eventually, even those that seemed to be far upwind of the source of infection have some chance of being infected, as the recirculating air slowly carries the virus with it across the room, just like it did in our earlier example. Finally, we can look at the Concentration View to see how the airflow is breaking not only the left–right symmetry of the room, but also the up–down symmetry. What do you think would happen if we reverse the direction that the waiter is circling the room? How would the picture change? Try changing the speed and direction of the airflow by dragging the slider found below the simulation to further explore the impact of flow. Epilogue The story of airborne infections is far from over, but our viral Visual Story has reached its end. Using nothing more than your browser and your curiosity, we've explored how airflow might alter the spread of an airborne virus, witnessed the transient and long-term effects that a simple cough can have, and seen the potentially superspreading effects of a wandering waiter. As with all our Stories, it is worth remembering the limitations of what we've learned. Our approach has knowingly ignored lots of factors that could be very important, including the potentially vast differences that can exists between different viruses and between different environments. So, while we've hopefully gained lots of intuition, we would do well to take our conclusions with a healthy pinch of salt. Looking for more? Not quite had enough of exploring airborne infections? You can play around with the speed of the air by opening our customisable simulation and moving the top-most slider that can be found under Parameters and beneath the label beginning with 'V'. Try exploring how the air speed impacts the spread of the virus. For the science behind this Story, we recommend that you check out the research of Zechariah Lau, Ian Griffiths (University of Oxford), Aaron English (University of Parma), and Katerina Kaouri (Cardiff University) on modelling the Covid-19 pandemic, which forms a basis for the mathematical models that we've just explored with VisualPDE. During the pandemic, they used similar models to provide recommendations to policymakers. We recommend checking out their airborne virus risk calculator, which inspired this Visual Story. Enjoyed this Visual Story? We'd love to hear your feedback at hello@visualpde.com. Looking for more VisualPDE? Try out our other Visual Stories or some mathematically flavoured content from Introductory PDEs. ","url":"/visual-stories/airborne-infections","tags":"","img":"/assets/images/VirusTransmission.webp","id":46},{"layout":"page","title":"Cleaning up contaminants","lesson_number":30,"thumbnail":"/assets/images/Decontamination.webp","extract":"Chemical decontamination in porous media","equation":"","body":"In this Story, we'll explore removing a contaminant from within a porous material by neutralising it in a chemical reaction. For example, the contaminant might be a hazardous liquid chemical that has seeped into a porous building material like concrete. We'll keep safe while doing this by making use of VisualPDE simulations to explore what happens. To decontaminate materials in practice, we often apply a cleaning chemical to the surface of the concrete, and wait while it diffuses down into the concrete and neutralises the hazardous contaminant. It’s crucial to react away all the contaminant. Here, we'll say the decontamination is complete when there is no contaminant left anywhere in the material, which will correspond to the simulations going completely white. How long does it take? The time taken to complete a decontamination depends on many things, including: properties of the chemical, such as the chemical reaction rate, physical parameters, including how deep the spill is, how saturated the material is, and how quickly the cleaning chemical can diffuse through the porous material to reach the contaminant. The simulation below lets us explore the effect of one of these factors: the chemical reaction rate, which we'll call . Clicking in the simulation adds a blob of cleansing chemical into the material. In reality, this is usually applied just to the upper surface (indicated by a thick black line), but here we can play around and add chemical to wherever we like. Try clicking to introduce cleanser, and watch as the green contaminant is cleaned up. At any time, you can reset the simulation by pressing To explore the role that the reaction rate plays, try adjusting the slider found just above the simulation, and see what effect clicking has now. For larger rates, the reaction is faster, and this speeds up the overall decontamination of the concrete. However, there’s a limit to how much we can speed it up by just varying this one parameter: for very large , the speed of cleaning is controlled by the rate of transport in the material, not , so we can’t continue to reduce the decontamination time by further increasing . You might also notice that for small the contaminant is (slowly) reacted away in a large region, whereas for large it only manages to clean small pockets of contaminant, leading to sharp boundaries separating the cleansed and contaminated regions. How much cleanser do we need? In practice, an easy way to speed up the cleaning process is to add more cleanser. The following pair of simulations lets us see this in action. In each, we're applying cleanser to the top of the concrete, but the simulation on the right is at double strength. Restart the process to get another look by pressing However, this approach is both wasteful and potentially dangerous: the cleaning chemical might be a strong acid or alkaline (like bleach) and so could damage the concrete if too much is left over after the decontamination. To measure this, we can define the efficiency of the decontamination process, which captures how much cleaning chemical is wasted: if the efficiency is 100% then all the cleaning chemical is used up in the decontamination, wasting nothing, but if the efficiency is low then lots of cleaning chemical is left in the concrete at the end of the decontamination. Here's a graph of efficiency vs decontamination time, where each point corresponds to a different amount of applied cleanser. As we've already seen, we find that the decontamination is faster when we increase the cleaning solution strength, but it is less efficient. In practice, we would need to choose what strength of cleaning solution to apply (i.e. where on the curve we sit) to get a good trade-off between speed and efficiency. This brings us to a final important question: Is there a way to reduce waste? Since the concentration of applied cleanser is the easiest thing to control, can we apply it in a clever way to keep the decontamination fast, but reduce the wasted cleaning chemical? Let's explore this with some simulations. We've set up two views into the same simulation: on the left we see the decontaminant, just like before, whilst on the right we see the cleanser (darker blue means more cleanser). The goal: make both simulations go pure white. Use the slider below to adjust the strength of the applied cleanser throughout the decontamination process. A good idea is to start with a strong cleaning solution and gradually reduce the strength: this keeps the decontamination fast and the efficiency high. Can you find any better ways by exploring? Reset any time by pressing About the decontamination model The mathematical model that we are using for these simulations is derived by considering the diffusion of the cleaning chemical and its reaction with the contaminant, within the pore space of the porous material. Rather than solve these equations in the very intricate, complicated pore-space domain, we’ve used a mathematical technique called homogenisation to average the equations. This makes them much easier and more computationally efficient to solve but keeps the important information from the underlying pore-space system. Specifically, the more contaminant there is, the harder it is to transport the cleaning chemical through the material, since the cleaning chemical has to navigate around the contaminant, in limited pore space. This manifests in the model as an effective diffusivity that depends on the local amount of contaminant. You can find more details on the mathematics discussed in this Story in the following articles: 1. Homogenisation problems in reactive decontamination (2019). EK Luckins, CJW Breward, IM Griffiths, Z Wilmott. European Journal of Applied Mathematics 31(5), 782-805. 1. The effect of pore-scale contaminant distribution on the reactive decontamination of porous media (2023). EK Luckins, CJW Breward, IM Griffiths, CP Please. European Journal of Applied Mathematics 1-41. 1. Optimising the Decontamination of Porous Building Materials (2023). H Turner. Masters thesis, University of Oxford. Looking for more? Not quite had enough of decontamination? To investigate other parameters in the model, check out this fully customisable simulation. Enjoyed this Visual Story? We'd love to hear your feedback at hello@visualpde.com. Looking for more VisualPDE? Try out our other Visual Stories or some mathematically flavoured content from Introductory PDEs. ","url":"/visual-stories/decontamination","tags":"","img":"/assets/images/Decontamination.webp","id":47},{"layout":"page","title":"Urban flooding","lesson_number":40,"thumbnail":"/assets/images/flooding.webp","extract":"Defending against surging rivers","equation":"","body":"In this Story, we'll explore the most frequent type of natural disaster: flooding. The prediction and prevention of flooding is difficult and far from solved, so we'll focus on visualising a caricature of a flood event rather than the real thing. We've picked the city of Oxford (UK) as our case study, as it often falls foul of flooding and 2/3 of the VisualPDE team have lived there. The river Thames flows around the city centre, which is surrounded by natural floodplains and houses. The image below shows part of the landscape just south of the city centre, shaded by height, and includes one of the team's old houses. There is a river in the upper right corner, a housing estate on the left, and fields in between. Topographical LiDAR data from the ARCHI MAPS UK website; LiDAR tiles © Environment Agency copyright and/or database right 2022. All rights reserved. Breaking the banks Flooding has a huge economic and social impact. In the simulation below, we'll explore what happens when a surge in the river causes the area around it to flood. Clicking in the simulation mimics emptying a (very large) bucket of water onto the environment, which spreads out and eventually seeps away into the ground. After you've played around with clicking, drag the slider to the right to increase the flow rate of the river to the maximum. The surging river quickly runs over the fields and encroaches on the road and the houses, eventually seeping down roads and into gardens and homes. But we can do more than explore a constantly surging river. Try resetting the simulation (or returning the flow to normal and waiting) and see what happens if you increase the flow and then decrease it again rapidly. This time, the river still bursts its banks but only manages to spread over the fields, with little to no impact on homes beyond the road. Defending against flooding There are many ways to prevent flooding. We'll use VisualPDE to explore the effects of two types of defence: improving drainage into the ground, diverting flood water. Naturally, our examples won't necessarily reflect the real thing, but they might help us see how these types of defence can be protective. Improving drainage The simulation below lets us vary two things: the flow rate of the river (top slider) and the absorption of water into the ground (bottom slider). Try exploring what happens during a surge if we improve the drainage of water, fully increasing the absorption. Even at the maximum flow rate, fully improved drainage completely contains the flood within the fields, protecting the rest of the environment. Explore how reducing the level of improvement gradually causes more and more of the region to be flooded. Diverting flood water An alternative to improving the absorption of the terrain is constructing channels that divert flood water away from at-risk areas. In the simulation below, clicking now carves deep trenches into the environment (much larger and deeper than real flood defences). Try drawing your own flood defence network and see if it holds water against a river surge. In our simulations of continuous high flow, the river almost always wins, filling up the trenches and spilling past towards the city. However, the defences can be very effective against shorter periods of high flow. Test this for yourself by only briefly increasing the flow rate. Looking for more? Flooding is a complicated issue and we certainly haven't explored everything in this Story. Hopefully, however, we've seen how different types of management can help alleviate the effects of urban flooding. If you want to explore more water-based simulations on VisualPDE, try out our page on the effects of topography or our Story exploring ripples on a pond. Enjoyed this Visual Story? We'd love to hear your feedback at hello@visualpde.com. Many thanks to Duncan Hewitt for his help in bringing this Story to life. Looking for more VisualPDE? Try out our other Visual Stories or some mathematically flavoured content from Introductory PDEs.","url":"/visual-stories/flooding","tags":"","img":"/assets/images/flooding.webp","id":48},{"layout":"page","title":"Ripples on a pond","lesson_number":10,"thumbnail":"/assets/images/ShallowWaterBox.webp","extract":"Making waves in shallow water","equation":"","body":"Waves on water can be mesmerising, especially the ripples that spread out after an object breaks the surface of an otherwise still liquid. Using VisualPDE, we can play around with water waves without any risk of spillages. Below you'll find a VisualPDE simulation set up to let us explore what happens when we press down on the surface of shallow water, just like a drop of water does as it hits the surface. Try clicking in the container to simulate a droplet landing in a still body of water. Making waves The drop of liquid immediately disturbs the surface, causing ripples to quickly spread out and fill the container. As soon as the ripples hit the edge of the box, they reflect back and mix with any waves still heading towards the edges. Eventually, these reflected ripples collide with those bouncing off the opposite wall, leading to large peaks and deep troughs. Curiously, after the ripples collide with one another, they seem to just carry on as if nothing had happened. In fact, the mathematics behind this type of waves tells us that this always happens. You can see this phenomenon at work when you throw multiple droplets into the water in rapid succession. You can try this out in real life, or you can press to reset the simulation and click in a few different places one after the other to try this out with VisualPDE in a water-free way. Regardless of which option you choose, you'll see the ripples pass right through each other, creating ever-changing patterns of overlapping circles. You might notice that, as time goes by, the ripples become less and less prominent, until they completely fade away. This is because the waves are losing energy all the time (due to friction and the slight stickiness of the water), leading to a smoother surface that will eventually become still again. All the waves that we've made so far have been pretty small. To generate bigger, wider waves, keep your mouse/pointer clicked on the same spot for a few seconds and then let go. Now we get different, large-scale patterns emerging on the surface of the water, whose size comes close to the limits of the theory that we're using to simulate water waves with VisualPDE. Time for reflection There is a lot left to explore about waves even in this simple-looking setting, such as investigating what happens when you click and drag? For now, we'll end this short exploration with something that's difficult to see in real life: perfect reflections in a circular container. In the simulation below, we've paused a simulation just as a drop of water hits the surface, precisely in the centre of a disc-shaped container. Press to see ripples surge out from the disturbance and reflect simultaneously off the curved boundary, creating ever-more-complicated patterns that are (almost) perfectly symmetric. If you like chaos, you can break the symmetry by clicking anywhere to disturb the surface. Looking for more? Not quite had enough of water waves? For a different perspective on this Visual Story, try pressing 3D in either of the simulations above. What you'll see is the surface of the water drawn in 3D – try dragging to change the view, or clicking on the surface to disturb it, and experience a new point of view. Enjoyed this Visual Story? We'd love to hear your feedback at hello@visualpde.com. Looking for more VisualPDE? Try out our other Visual Stories or some mathematically flavoured content from Introductory PDEs. ","url":"/visual-stories/ripples","tags":"","img":"/assets/images/ShallowWaterBox.webp","id":49},{"layout":"page","title":"About","permalink":"/about/","thumbnail":"/assets/images/question-marks.webp","extract":"What is VisualPDE, where did it come from and who is behind it?","body":"VisualPDE is a website designed to bring the world of partial differential equations (PDEs) to a wider audience through the use of real-time interactive web-based simulations, usable on almost any device. This heart-shaped pattern isn't a video. It's a simulation of a PDE system running live on your device, or it would be if JavaScript was enabled. We provide numerous example simulations on the site, exploring a wide variety of topics from waves and transport theory, to chaotic nonlinear physical systems and pattern-forming models in mathematical biology. VisualPDE simulations can also be found in recent scientific works (see below), allowing you to instantly reproduce cutting-edge findings live on your device. People using VisualPDE Tens of thousands of simulations have been performed using VisualPDE. External applications of VisualPDE include: - An interactive logo for the Society for Mathematical Biology - Visualising landslides using real topographical data from Brazil, with the Institute for Mathematical Innovation, University of Bath - Providing figures and supporting simulations for a rigorous study of localised pattern formation in dryalnd vegetation - Numerical simulation of temporal and spatiotemporal oscillations in a model of viral cancer therapy - A paper demonstrating the insufficiency of linear stability theory in understanding Turing patterns - Exploring the principles behind the design of simple but effective robotic filaments for microscale swimming in a multidisciplinary paper Using VisualPDE Our collections of Visual Stories and Introductory PDEs are a good place to start exploring, after which you can delve into the other collections found on the home page. You can also check out our detailed User guide and the dedicated Quick start guide. Beyond our curated examples, we hope to encourage advanced users to design their own simulations. Anyone can design their own model simulations and share them with a URL, or copy the markdown-based website from GitHub to design their own website for use in teaching or research communication (see our licence if you're looking for industrial use). Origins and contributors The ideas for this website originated in a Durham Centre for Academic Development collaborative innovation grant titled _Accessible interactive visualisations in mathematical biology_, which supported Alex Chudasama (a final-year undergraduate at Durham University) to design an early version of an interactive PDE solver based on this Gray–Scott reaction–diffusion simulator. The current website and tools are written and maintained by Benjamin Walker, Adam Townsend and Andrew Krause. A detailed article about the context, design, and applications of VisualPDE can be found in the Bulletin of Mathematical Biology. ","url":"/about","tags":"","equation":"undefined","img":"/assets/images/question-marks.webp","id":50},{"layout":"topic","title":"Art of PDEs","collection_to_list":"art-pdes","thumbnail":"/assets/images/alan4.webp","extract":"Beauty in time and space","body":"A collection of visually-pleasing simulations, which can be tailored to a user's taste. ","url":"/art-pdes","tags":"","equation":"undefined","img":"/assets/images/alan4.webp","id":51},{"layout":"topic","title":"Introductory PDEs","collection_to_list":"basic-pdes","thumbnail":"/assets/images/heat-equation.webp","extract":"Explore simple models interactively","body":"This is a collection of classical linear PDEs that can be explored interactively. They complement the quick start guide in introducing features of the VisualPDE solver. ","url":"/basic-pdes","tags":"","equation":"undefined","img":"/assets/images/heat-equation.webp","id":52},{"title":"Contact","layout":"suggestions","body":"We would love to hear from you at hello@visualpde.com, or you can use the box below. If you have suggestion for a new page, Visual Story, feature or improvement, we'd love to hear some details. The box below includes a basic markdown preview, so you can type directly and see your suggestion typeset automatically. ","url":"/contact","tags":"","extract":"undefined","equation":"undefined","img":"","id":53},{"layout":"topic","title":"Mathematical biology","collection_to_list":"mathematical-biology","thumbnail":"/assets/images/squirrel.webp","extract":"Squirrels, waves and patterns","body":"","url":"/mathematical-biology","tags":"","equation":"undefined","img":"/assets/images/squirrel.webp","id":54},{"layout":"topic","title":"Nonlinear physics","collection_to_list":"nonlinear-physics","thumbnail":"/assets/images/optics.webp","extract":"Optics, QFT and the rest","body":"","url":"/nonlinear-physics","tags":"","equation":"undefined","img":"/assets/images/optics.webp","id":55},{"layout":"topic","title":"Numerical methods","collection_to_list":"numerical-methods","thumbnail":"/assets/images/NumericalMethodsImage.webp","extract":"Adventures in numerical analysis","body":"This is a collection of topics on numerical methods and analysis relevant to solving PDEs numerically. These are particularly tailored for how VisualPDE works 'under the hood', which is described in more detail in the solver documentation and the advanced documentation. ","url":"/numerical-methods","tags":"","equation":"undefined","img":"/assets/images/NumericalMethodsImage.webp","id":56},{"title":"Interactive simulation","layout":"sim","permalink":"/sim/","body":"","url":"/sim","tags":"","extract":"undefined","equation":"undefined","img":"","id":57},{"layout":"docs","title":"User guide","collection_to_list":"user-guide","thumbnail":"/assets/images/squirrel-question.webp","extract":"Everything there is to know about VisualPDE","body":"","url":"/user-guide","tags":"","equation":"undefined","img":"/assets/images/squirrel-question.webp","id":58},{"layout":"topic","title":"Visual stories","collection_to_list":"visual-stories","thumbnail":"/assets/images/OnceUponATime.webp","extract":"Not a mathematician? No problem","body":"With VisualPDE, you don't need to be a mathematician to explore the world with mathematics. Here, we're building a collection of interactive examples and stories that address real-world problems and explore complex phenomena. The best part: the barrier to entry is curiosity, not mathematical knowledge. ","url":"/visual-stories","tags":"","equation":"undefined","img":"/assets/images/OnceUponATime.webp","id":59}]